waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_adc.h
#define    ADC_CFGR1_PEFSEL_Pos                                   (0U)
#define    ADC_CFGR1_PEFSEL_Msk                                   (0x3U << ADC_CFGR1_PEFSEL_Pos)
#define    ADC_CFGR1_PEFSEL                                       ADC_CFGR1_PEFSEL_Msk

#define    ADC_CFGR2_AVGR_Pos                                     (18U)
#define    ADC_CFGR2_AVGR_Msk                                     (0x3U << ADC_CFGR2_AVGR_Pos)
#define    ADC_CFGR2_AVGR                                         ADC_CFGR2_AVGR_Msk

#define    ADC_CFGR2_AVGEN_Pos                                    (16U)
#define    ADC_CFGR2_AVGEN_Msk                                    (0x3U << ADC_CFGR2_AVGEN_Pos)
#define    ADC_CFGR2_AVGEN                                        ADC_CFGR2_AVGEN_Msk

#define    ADC_CFGR2_WAIT_Pos                                     (11U)
#define    ADC_CFGR2_WAIT_Msk                                     (0x1U << ADC_CFGR2_WAIT_Pos)
#define    ADC_CFGR2_WAIT                                         ADC_CFGR2_WAIT_Msk

#define    ADC_CFGR2_TMOD_Pos                                     (9U)
#define    ADC_CFGR2_TMOD_Msk                                     (0x3U << ADC_CFGR2_TMOD_Pos)
#define    ADC_CFGR2_TMOD                                         ADC_CFGR2_TMOD_Msk

#define    ADC_CFGR2_OVRM_Pos                                     (8U)
#define    ADC_CFGR2_OVRM_Msk                                     (0x1U << ADC_CFGR2_OVRM_Pos)
#define    ADC_CFGR2_OVRM                                         ADC_CFGR2_OVRM_Msk

#define    ADC_CFGR2_DMAEN_Pos                                    (0U)
#define    ADC_CFGR2_DMAEN_Msk                                    (0x1U << ADC_CFGR2_DMAEN_Pos)
#define    ADC_CFGR2_DMAEN                                        ADC_CFGR2_DMAEN_Msk

#define    ADC_PRICR_INJC_Pos                                     (0U)
#define    ADC_PRICR_INJC_Msk                                     (0xfU << ADC_PRICR_INJC_Pos)
#define    ADC_PRICR_INJC                                         ADC_PRICR_INJC_Msk

#define    ADC_DMR_DM14_Pos                                       (7U)
#define    ADC_DMR_DM14_Msk                                       (0x1U << ADC_DMR_DM14_Pos)
#define    ADC_DMR_DM14                                           ADC_DMR_DM14_Msk

#define    ADC_DMR_DM12_Pos                                       (6U)
#define    ADC_DMR_DM12_Msk                                       (0x1U << ADC_DMR_DM12_Pos)
#define    ADC_DMR_DM12                                           ADC_DMR_DM12_Msk

#define    ADC_DMR_DM10_Pos                                       (5U)
#define    ADC_DMR_DM10_Msk                                       (0x1U << ADC_DMR_DM10_Pos)
#define    ADC_DMR_DM10                                           ADC_DMR_DM10_Msk

#define    ADC_DMR_DM8_Pos                                        (4U)
#define    ADC_DMR_DM8_Msk                                        (0x1U << ADC_DMR_DM8_Pos)
#define    ADC_DMR_DM8                                            ADC_DMR_DM8_Msk

#define    ADC_DMR_DM6_Pos                                        (3U)
#define    ADC_DMR_DM6_Msk                                        (0x1U << ADC_DMR_DM6_Pos)
#define    ADC_DMR_DM6                                            ADC_DMR_DM6_Msk

#define    ADC_DMR_DM4_Pos                                        (2U)
#define    ADC_DMR_DM4_Msk                                        (0x1U << ADC_DMR_DM4_Pos)
#define    ADC_DMR_DM4                                            ADC_DMR_DM4_Msk

#define    ADC_DMR_DM2_Pos                                        (1U)
#define    ADC_DMR_DM2_Msk                                        (0x1U << ADC_DMR_DM2_Pos)
#define    ADC_DMR_DM2                                            ADC_DMR_DM2_Msk

#define    ADC_DMR_DM0_Pos                                        (0U)
#define    ADC_DMR_DM0_Msk                                        (0x1U << ADC_DMR_DM0_Pos)
#define    ADC_DMR_DM0                                            ADC_DMR_DM0_Msk

#define    ADC_OSR_POS_CALI_Pos                                   (16U)
#define    ADC_OSR_POS_CALI_Msk                                   (0x1fffU << ADC_OSR_POS_CALI_Pos)
#define    ADC_OSR_POS_CALI                                       ADC_OSR_POS_CALI_Msk

#define    ADC_OSR_NOS_CALI_Pos                                   (0U)
#define    ADC_OSR_NOS_CALI_Msk                                   (0x1fffU << ADC_OSR_NOS_CALI_Pos)
#define    ADC_OSR_NOS_CALI                                       ADC_OSR_NOS_CALI_Msk

#define    ADC_ACQ_SR_REQ_Pos                                     (0U)
#define    ADC_ACQ_SR_REQ_Msk                                     (0xffffU << ADC_ACQ_SR_REQ_Pos)
#define    ADC_ACQ_SR_REQ                                         ADC_ACQ_SR_REQ_Msk

#define    ADC_ACQ0_CR_CHSEL_Pos                                  (9U)
#define    ADC_ACQ0_CR_CHSEL_Msk                                  (0x1fU << ADC_ACQ0_CR_CHSEL_Pos)
#define    ADC_ACQ0_CR_CHSEL                                      ADC_ACQ0_CR_CHSEL_Msk

#define    ADC_ACQ0_CR_TRIGSEL_Pos                                (4U)
#define    ADC_ACQ0_CR_TRIGSEL_Msk                                (0x1fU << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    ADC_ACQ0_CR_TRIGSEL                                    ADC_ACQ0_CR_TRIGSEL_Msk

#define    ADC_ACQ0_CR_SMTS_Pos                                   (0U)
#define    ADC_ACQ0_CR_SMTS_Msk                                   (0xfU << ADC_ACQ0_CR_SMTS_Pos)
#define    ADC_ACQ0_CR_SMTS                                       ADC_ACQ0_CR_SMTS_Msk

#define    ADC_ACQ1_CR_CHSEL_Pos                                  (9U)
#define    ADC_ACQ1_CR_CHSEL_Msk                                  (0x1fU << ADC_ACQ1_CR_CHSEL_Pos)
#define    ADC_ACQ1_CR_CHSEL                                      ADC_ACQ1_CR_CHSEL_Msk

#define    ADC_ACQ1_CR_TRIGSEL_Pos                                (4U)
#define    ADC_ACQ1_CR_TRIGSEL_Msk                                (0x1fU << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    ADC_ACQ1_CR_TRIGSEL                                    ADC_ACQ1_CR_TRIGSEL_Msk

