waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_adc.h
#define    ADC_ACQ1_CR_SMTS_Pos                                   (0U)
#define    ADC_ACQ1_CR_SMTS_Msk                                   (0xfU << ADC_ACQ1_CR_SMTS_Pos)
#define    ADC_ACQ1_CR_SMTS                                       ADC_ACQ1_CR_SMTS_Msk

#define    ADC_ACQ2_CR_CHSEL_Pos                                  (9U)
#define    ADC_ACQ2_CR_CHSEL_Msk                                  (0x1fU << ADC_ACQ2_CR_CHSEL_Pos)
#define    ADC_ACQ2_CR_CHSEL                                      ADC_ACQ2_CR_CHSEL_Msk

#define    ADC_ACQ2_CR_TRIGSEL_Pos                                (4U)
#define    ADC_ACQ2_CR_TRIGSEL_Msk                                (0x1fU << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    ADC_ACQ2_CR_TRIGSEL                                    ADC_ACQ2_CR_TRIGSEL_Msk

#define    ADC_ACQ2_CR_SMTS_Pos                                   (0U)
#define    ADC_ACQ2_CR_SMTS_Msk                                   (0xfU << ADC_ACQ2_CR_SMTS_Pos)
#define    ADC_ACQ2_CR_SMTS                                       ADC_ACQ2_CR_SMTS_Msk

#define    ADC_ACQ3_CR_CHSEL_Pos                                  (9U)
#define    ADC_ACQ3_CR_CHSEL_Msk                                  (0x1fU << ADC_ACQ3_CR_CHSEL_Pos)
#define    ADC_ACQ3_CR_CHSEL                                      ADC_ACQ3_CR_CHSEL_Msk

#define    ADC_ACQ3_CR_TRIGSEL_Pos                                (4U)
#define    ADC_ACQ3_CR_TRIGSEL_Msk                                (0x1fU << ADC_ACQ3_CR_TRIGSEL_Pos)
#define    ADC_ACQ3_CR_TRIGSEL                                    ADC_ACQ3_CR_TRIGSEL_Msk

#define    ADC_ACQ3_CR_SMTS_Pos                                   (0U)
#define    ADC_ACQ3_CR_SMTS_Msk                                   (0xfU << ADC_ACQ3_CR_SMTS_Pos)
#define    ADC_ACQ3_CR_SMTS                                       ADC_ACQ3_CR_SMTS_Msk

#define    ADC_ACQ4_CR_CHSEL_Pos                                  (9U)
#define    ADC_ACQ4_CR_CHSEL_Msk                                  (0x1fU << ADC_ACQ4_CR_CHSEL_Pos)
#define    ADC_ACQ4_CR_CHSEL                                      ADC_ACQ4_CR_CHSEL_Msk

#define    ADC_ACQ4_CR_TRIGSEL_Pos                                (4U)
#define    ADC_ACQ4_CR_TRIGSEL_Msk                                (0x1fU << ADC_ACQ4_CR_TRIGSEL_Pos)
#define    ADC_ACQ4_CR_TRIGSEL                                    ADC_ACQ4_CR_TRIGSEL_Msk

#define    ADC_ACQ4_CR_SMTS_Pos                                   (0U)
#define    ADC_ACQ4_CR_SMTS_Msk                                   (0xfU << ADC_ACQ4_CR_SMTS_Pos)
#define    ADC_ACQ4_CR_SMTS                                       ADC_ACQ4_CR_SMTS_Msk

#define    ADC_ACQ5_CR_CHSEL_Pos                                  (9U)
#define    ADC_ACQ5_CR_CHSEL_Msk                                  (0x1fU << ADC_ACQ5_CR_CHSEL_Pos)
#define    ADC_ACQ5_CR_CHSEL                                      ADC_ACQ5_CR_CHSEL_Msk

#define    ADC_ACQ5_CR_TRIGSEL_Pos                                (4U)
#define    ADC_ACQ5_CR_TRIGSEL_Msk                                (0x1fU << ADC_ACQ5_CR_TRIGSEL_Pos)
#define    ADC_ACQ5_CR_TRIGSEL                                    ADC_ACQ5_CR_TRIGSEL_Msk

#define    ADC_ACQ5_CR_SMTS_Pos                                   (0U)
#define    ADC_ACQ5_CR_SMTS_Msk                                   (0xfU << ADC_ACQ5_CR_SMTS_Pos)
#define    ADC_ACQ5_CR_SMTS                                       ADC_ACQ5_CR_SMTS_Msk

#define    ADC_ACQ6_CR_CHSEL_Pos                                  (9U)
#define    ADC_ACQ6_CR_CHSEL_Msk                                  (0x1fU << ADC_ACQ6_CR_CHSEL_Pos)
#define    ADC_ACQ6_CR_CHSEL                                      ADC_ACQ6_CR_CHSEL_Msk

#define    ADC_ACQ6_CR_TRIGSEL_Pos                                (4U)
#define    ADC_ACQ6_CR_TRIGSEL_Msk                                (0x1fU << ADC_ACQ6_CR_TRIGSEL_Pos)
#define    ADC_ACQ6_CR_TRIGSEL                                    ADC_ACQ6_CR_TRIGSEL_Msk

#define    ADC_ACQ6_CR_SMTS_Pos                                   (0U)
#define    ADC_ACQ6_CR_SMTS_Msk                                   (0xfU << ADC_ACQ6_CR_SMTS_Pos)
#define    ADC_ACQ6_CR_SMTS                                       ADC_ACQ6_CR_SMTS_Msk

#define    ADC_ACQ7_CR_CHSEL_Pos                                  (9U)
#define    ADC_ACQ7_CR_CHSEL_Msk                                  (0x1fU << ADC_ACQ7_CR_CHSEL_Pos)
#define    ADC_ACQ7_CR_CHSEL                                      ADC_ACQ7_CR_CHSEL_Msk

#define    ADC_ACQ7_CR_TRIGSEL_Pos                                (4U)
#define    ADC_ACQ7_CR_TRIGSEL_Msk                                (0x1fU << ADC_ACQ7_CR_TRIGSEL_Pos)
#define    ADC_ACQ7_CR_TRIGSEL                                    ADC_ACQ7_CR_TRIGSEL_Msk

#define    ADC_ACQ7_CR_SMTS_Pos                                   (0U)
#define    ADC_ACQ7_CR_SMTS_Msk                                   (0xfU << ADC_ACQ7_CR_SMTS_Pos)
#define    ADC_ACQ7_CR_SMTS                                       ADC_ACQ7_CR_SMTS_Msk

#define    ADC_ACQ8_CR_CHSEL_Pos                                  (9U)
#define    ADC_ACQ8_CR_CHSEL_Msk                                  (0x1fU << ADC_ACQ8_CR_CHSEL_Pos)
#define    ADC_ACQ8_CR_CHSEL                                      ADC_ACQ8_CR_CHSEL_Msk

#define    ADC_ACQ8_CR_TRIGSEL_Pos                                (4U)
#define    ADC_ACQ8_CR_TRIGSEL_Msk                                (0x1fU << ADC_ACQ8_CR_TRIGSEL_Pos)
#define    ADC_ACQ8_CR_TRIGSEL                                    ADC_ACQ8_CR_TRIGSEL_Msk

#define    ADC_ACQ8_CR_SMTS_Pos                                   (0U)
#define    ADC_ACQ8_CR_SMTS_Msk                                   (0xfU << ADC_ACQ8_CR_SMTS_Pos)
#define    ADC_ACQ8_CR_SMTS                                       ADC_ACQ8_CR_SMTS_Msk

#define    ADC_ACQ9_CR_CHSEL_Pos                                  (9U)
#define    ADC_ACQ9_CR_CHSEL_Msk                                  (0x1fU << ADC_ACQ9_CR_CHSEL_Pos)
#define    ADC_ACQ9_CR_CHSEL                                      ADC_ACQ9_CR_CHSEL_Msk

#define    ADC_ACQ9_CR_TRIGSEL_Pos                                (4U)
#define    ADC_ACQ9_CR_TRIGSEL_Msk                                (0x1fU << ADC_ACQ9_CR_TRIGSEL_Pos)
#define    ADC_ACQ9_CR_TRIGSEL                                    ADC_ACQ9_CR_TRIGSEL_Msk

#define    ADC_ACQ9_CR_SMTS_Pos                                   (0U)
#define    ADC_ACQ9_CR_SMTS_Msk                                   (0xfU << ADC_ACQ9_CR_SMTS_Pos)
#define    ADC_ACQ9_CR_SMTS                                       ADC_ACQ9_CR_SMTS_Msk

#define    ADC_ACQ10_CR_CHSEL_Pos                                 (9U)
#define    ADC_ACQ10_CR_CHSEL_Msk                                 (0x1fU << ADC_ACQ10_CR_CHSEL_Pos)
#define    ADC_ACQ10_CR_CHSEL                                     ADC_ACQ10_CR_CHSEL_Msk

