waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_adc.h
#define    ADC_ACQ10_CR_TRIGSEL_Pos                               (4U)
#define    ADC_ACQ10_CR_TRIGSEL_Msk                               (0x1fU << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    ADC_ACQ10_CR_TRIGSEL                                   ADC_ACQ10_CR_TRIGSEL_Msk

#define    ADC_ACQ10_CR_SMTS_Pos                                  (0U)
#define    ADC_ACQ10_CR_SMTS_Msk                                  (0xfU << ADC_ACQ10_CR_SMTS_Pos)
#define    ADC_ACQ10_CR_SMTS                                      ADC_ACQ10_CR_SMTS_Msk

#define    ADC_ACQ11_CR_CHSEL_Pos                                 (9U)
#define    ADC_ACQ11_CR_CHSEL_Msk                                 (0x1fU << ADC_ACQ11_CR_CHSEL_Pos)
#define    ADC_ACQ11_CR_CHSEL                                     ADC_ACQ11_CR_CHSEL_Msk

#define    ADC_ACQ11_CR_TRIGSEL_Pos                               (4U)
#define    ADC_ACQ11_CR_TRIGSEL_Msk                               (0x1fU << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    ADC_ACQ11_CR_TRIGSEL                                   ADC_ACQ11_CR_TRIGSEL_Msk

#define    ADC_ACQ11_CR_SMTS_Pos                                  (0U)
#define    ADC_ACQ11_CR_SMTS_Msk                                  (0xfU << ADC_ACQ11_CR_SMTS_Pos)
#define    ADC_ACQ11_CR_SMTS                                      ADC_ACQ11_CR_SMTS_Msk

#define    ADC_ACQ12_CR_CHSEL_Pos                                 (9U)
#define    ADC_ACQ12_CR_CHSEL_Msk                                 (0x1fU << ADC_ACQ12_CR_CHSEL_Pos)
#define    ADC_ACQ12_CR_CHSEL                                     ADC_ACQ12_CR_CHSEL_Msk

#define    ADC_ACQ12_CR_TRIGSEL_Pos                               (4U)
#define    ADC_ACQ12_CR_TRIGSEL_Msk                               (0x1fU << ADC_ACQ12_CR_TRIGSEL_Pos)
#define    ADC_ACQ12_CR_TRIGSEL                                   ADC_ACQ12_CR_TRIGSEL_Msk

#define    ADC_ACQ12_CR_SMTS_Pos                                  (0U)
#define    ADC_ACQ12_CR_SMTS_Msk                                  (0xfU << ADC_ACQ12_CR_SMTS_Pos)
#define    ADC_ACQ12_CR_SMTS                                      ADC_ACQ12_CR_SMTS_Msk

#define    ADC_ACQ13_CR_CHSEL_Pos                                 (9U)
#define    ADC_ACQ13_CR_CHSEL_Msk                                 (0x1fU << ADC_ACQ13_CR_CHSEL_Pos)
#define    ADC_ACQ13_CR_CHSEL                                     ADC_ACQ13_CR_CHSEL_Msk

#define    ADC_ACQ13_CR_TRIGSEL_Pos                               (4U)
#define    ADC_ACQ13_CR_TRIGSEL_Msk                               (0x1fU << ADC_ACQ13_CR_TRIGSEL_Pos)
#define    ADC_ACQ13_CR_TRIGSEL                                   ADC_ACQ13_CR_TRIGSEL_Msk

#define    ADC_ACQ13_CR_SMTS_Pos                                  (0U)
#define    ADC_ACQ13_CR_SMTS_Msk                                  (0xfU << ADC_ACQ13_CR_SMTS_Pos)
#define    ADC_ACQ13_CR_SMTS                                      ADC_ACQ13_CR_SMTS_Msk

#define    ADC_ACQ14_CR_CHSEL_Pos                                 (9U)
#define    ADC_ACQ14_CR_CHSEL_Msk                                 (0x1fU << ADC_ACQ14_CR_CHSEL_Pos)
#define    ADC_ACQ14_CR_CHSEL                                     ADC_ACQ14_CR_CHSEL_Msk

#define    ADC_ACQ14_CR_TRIGSEL_Pos                               (4U)
#define    ADC_ACQ14_CR_TRIGSEL_Msk                               (0x1fU << ADC_ACQ14_CR_TRIGSEL_Pos)
#define    ADC_ACQ14_CR_TRIGSEL                                   ADC_ACQ14_CR_TRIGSEL_Msk

#define    ADC_ACQ14_CR_SMTS_Pos                                  (0U)
#define    ADC_ACQ14_CR_SMTS_Msk                                  (0xfU << ADC_ACQ14_CR_SMTS_Pos)
#define    ADC_ACQ14_CR_SMTS                                      ADC_ACQ14_CR_SMTS_Msk

#define    ADC_ACQ15_CR_CHSEL_Pos                                 (9U)
#define    ADC_ACQ15_CR_CHSEL_Msk                                 (0x1fU << ADC_ACQ15_CR_CHSEL_Pos)
#define    ADC_ACQ15_CR_CHSEL                                     ADC_ACQ15_CR_CHSEL_Msk

#define    ADC_ACQ15_CR_TRIGSEL_Pos                               (4U)
#define    ADC_ACQ15_CR_TRIGSEL_Msk                               (0x1fU << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    ADC_ACQ15_CR_TRIGSEL                                   ADC_ACQ15_CR_TRIGSEL_Msk

#define    ADC_ACQ15_CR_SMTS_Pos                                  (0U)
#define    ADC_ACQ15_CR_SMTS_Msk                                  (0xfU << ADC_ACQ15_CR_SMTS_Pos)
#define    ADC_ACQ15_CR_SMTS                                      ADC_ACQ15_CR_SMTS_Msk

#define    ADC_ACQ0_DR_RESULT_Pos                                 (0U)
#define    ADC_ACQ0_DR_RESULT_Msk                                 (0xfffU << ADC_ACQ0_DR_RESULT_Pos)
#define    ADC_ACQ0_DR_RESULT                                     ADC_ACQ0_DR_RESULT_Msk

#define    ADC_ACQ1_DR_RESULT_Pos                                 (0U)
#define    ADC_ACQ1_DR_RESULT_Msk                                 (0xfffU << ADC_ACQ1_DR_RESULT_Pos)
#define    ADC_ACQ1_DR_RESULT                                     ADC_ACQ1_DR_RESULT_Msk

#define    ADC_ACQ2_DR_RESULT_Pos                                 (0U)
#define    ADC_ACQ2_DR_RESULT_Msk                                 (0xfffU << ADC_ACQ2_DR_RESULT_Pos)
#define    ADC_ACQ2_DR_RESULT                                     ADC_ACQ2_DR_RESULT_Msk

#define    ADC_ACQ3_DR_RESULT_Pos                                 (0U)
#define    ADC_ACQ3_DR_RESULT_Msk                                 (0xfffU << ADC_ACQ3_DR_RESULT_Pos)
#define    ADC_ACQ3_DR_RESULT                                     ADC_ACQ3_DR_RESULT_Msk

#define    ADC_ACQ4_DR_RESULT_Pos                                 (0U)
#define    ADC_ACQ4_DR_RESULT_Msk                                 (0xfffU << ADC_ACQ4_DR_RESULT_Pos)
#define    ADC_ACQ4_DR_RESULT                                     ADC_ACQ4_DR_RESULT_Msk

#define    ADC_ACQ5_DR_RESULT_Pos                                 (0U)
#define    ADC_ACQ5_DR_RESULT_Msk                                 (0xfffU << ADC_ACQ5_DR_RESULT_Pos)
#define    ADC_ACQ5_DR_RESULT                                     ADC_ACQ5_DR_RESULT_Msk

#define    ADC_ACQ6_DR_RESULT_Pos                                 (0U)
#define    ADC_ACQ6_DR_RESULT_Msk                                 (0xfffU << ADC_ACQ6_DR_RESULT_Pos)
#define    ADC_ACQ6_DR_RESULT                                     ADC_ACQ6_DR_RESULT_Msk

#define    ADC_ACQ7_DR_RESULT_Pos                                 (0U)
#define    ADC_ACQ7_DR_RESULT_Msk                                 (0xfffU << ADC_ACQ7_DR_RESULT_Pos)
#define    ADC_ACQ7_DR_RESULT                                     ADC_ACQ7_DR_RESULT_Msk

#define    ADC_ACQ8_DR_RESULT_Pos                                 (0U)
#define    ADC_ACQ8_DR_RESULT_Msk                                 (0xfffU << ADC_ACQ8_DR_RESULT_Pos)
#define    ADC_ACQ8_DR_RESULT                                     ADC_ACQ8_DR_RESULT_Msk

#define    ADC_ACQ9_DR_RESULT_Pos                                 (0U)
#define    ADC_ACQ9_DR_RESULT_Msk                                 (0xfffU << ADC_ACQ9_DR_RESULT_Pos)
#define    ADC_ACQ9_DR_RESULT                                     ADC_ACQ9_DR_RESULT_Msk

#define    ADC_ACQ10_DR_RESULT_Pos                                (0U)
#define    ADC_ACQ10_DR_RESULT_Msk                                (0xfffU << ADC_ACQ10_DR_RESULT_Pos)
#define    ADC_ACQ10_DR_RESULT                                    ADC_ACQ10_DR_RESULT_Msk

#define    ADC_ACQ11_DR_RESULT_Pos                                (0U)
#define    ADC_ACQ11_DR_RESULT_Msk                                (0xfffU << ADC_ACQ11_DR_RESULT_Pos)
#define    ADC_ACQ11_DR_RESULT                                    ADC_ACQ11_DR_RESULT_Msk

#define    ADC_ACQ12_DR_RESULT_Pos                                (0U)
#define    ADC_ACQ12_DR_RESULT_Msk                                (0xfffU << ADC_ACQ12_DR_RESULT_Pos)
#define    ADC_ACQ12_DR_RESULT                                    ADC_ACQ12_DR_RESULT_Msk

#define    ADC_ACQ13_DR_RESULT_Pos                                (0U)
#define    ADC_ACQ13_DR_RESULT_Msk                                (0xfffU << ADC_ACQ13_DR_RESULT_Pos)
#define    ADC_ACQ13_DR_RESULT                                    ADC_ACQ13_DR_RESULT_Msk

#define    ADC_ACQ14_DR_RESULT_Pos                                (0U)
#define    ADC_ACQ14_DR_RESULT_Msk                                (0xfffU << ADC_ACQ14_DR_RESULT_Pos)
#define    ADC_ACQ14_DR_RESULT                                    ADC_ACQ14_DR_RESULT_Msk

