waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_adc.h
#define    ADC_ACQ15_DR_RESULT_Pos                                (0U)
#define    ADC_ACQ15_DR_RESULT_Msk                                (0xfffU << ADC_ACQ15_DR_RESULT_Pos)
#define    ADC_ACQ15_DR_RESULT                                    ADC_ACQ15_DR_RESULT_Msk

#define    ADC_DMACOMB_CR_COMB_ACQEN_Pos                          (0U)
#define    ADC_DMACOMB_CR_COMB_ACQEN_Msk                          (0xffffU << ADC_DMACOMB_CR_COMB_ACQEN_Pos)
#define    ADC_DMACOMB_CR_COMB_ACQEN                              ADC_DMACOMB_CR_COMB_ACQEN_Msk

#define    ADC_DMACOMB_DR_ACQ_ID_Pos                              (16U)
#define    ADC_DMACOMB_DR_ACQ_ID_Msk                              (0xfU << ADC_DMACOMB_DR_ACQ_ID_Pos)
#define    ADC_DMACOMB_DR_ACQ_ID                                  ADC_DMACOMB_DR_ACQ_ID_Msk

#define    ADC_DMACOMB_DR_COMB_DR_Pos                             (0U)
#define    ADC_DMACOMB_DR_COMB_DR_Msk                             (0xfffU << ADC_DMACOMB_DR_COMB_DR_Pos)
#define    ADC_DMACOMB_DR_COMB_DR                                 ADC_DMACOMB_DR_COMB_DR_Msk

#define    FL_ADC_ACQ0                                            (0x1U << 0U)
#define    FL_ADC_ACQ1                                            (0x1U << 1U)
#define    FL_ADC_ACQ2                                            (0x1U << 2U)
#define    FL_ADC_ACQ3                                            (0x1U << 3U)
#define    FL_ADC_ACQ4                                            (0x1U << 4U)
#define    FL_ADC_ACQ5                                            (0x1U << 5U)
#define    FL_ADC_ACQ6                                            (0x1U << 6U)
#define    FL_ADC_ACQ7                                            (0x1U << 7U)
#define    FL_ADC_ACQ8                                            (0x1U << 8U)
#define    FL_ADC_ACQ9                                            (0x1U << 9U)
#define    FL_ADC_ACQ10                                           (0x1U << 10U)
#define    FL_ADC_ACQ11                                           (0x1U << 11U)
#define    FL_ADC_ACQ12                                           (0x1U << 12U)
#define    FL_ADC_ACQ13                                           (0x1U << 13U)
#define    FL_ADC_ACQ14                                           (0x1U << 14U)
#define    FL_ADC_ACQ15                                           (0x1U << 15U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INA0                         (0x0U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INA1                         (0x1U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INA2                         (0x2U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INA3                         (0x3U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INA4                         (0x4U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INA5                         (0x5U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INA6                         (0x6U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INA7                         (0x7U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INA8_OPA0_OUT                (0x8U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_TS                           (0x9U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_AVREF                        (0xaU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_P_CALIBRATION                (0xcU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INB0                         (0x10U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INB1                         (0x11U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INB2                         (0x12U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INB3                         (0x13U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INB4                         (0x14U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INB5                         (0x15U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INB6                         (0x16U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INB7                         (0x17U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_INB8_OPA1_OUT                (0x18U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_VBAT_DIV3                   (0x19U << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_DAC0                         (0x1aU << 9U)
#define    FL_ADC_ACQ_SELECT_CHANNEL_N_CALIBRATION                (0x1cU << 9U)
#define    FL_ADC_ACQ_TRGI_SOFE_TRG                               (0x0U << 4U)
#define    FL_ADC_ACQ_TRGI_LUT0_TRG                               (0x1U << 4U)
#define    FL_ADC_ACQ_TRGI_LUT1_TRG                               (0x2U << 4U)
#define    FL_ADC_ACQ_TRGI_LUT2_TRG                               (0x3U << 4U)
#define    FL_ADC_ACQ_TRGI_LUT3_TRG                               (0x4U << 4U)
#define    FL_ADC_ACQ_TRGI_ATIM0_TRGO                             (0x5U << 4U)
#define    FL_ADC_ACQ_TRGI_ATIM1_TRGO                             (0x6U << 4U)
#define    FL_ADC_ACQ_TRGI_ATIM0_TRGO2                            (0x7U << 4U)
#define    FL_ADC_ACQ_TRGI_ATIM1_TRGO2                            (0x8U << 4U)
#define    FL_ADC_ACQ_TRGI_GPTIM0_TRGO                            (0x9U << 4U)
#define    FL_ADC_ACQ_TRGI_GPTIM1_TRGO                            (0xaU << 4U)
#define    FL_ADC_ACQ_TRGI_GPTIM2_TRGO                            (0xbU << 4U)
#define    FL_ADC_ACQ_TRGI_EPWM0SOCA                              (0xcU << 4U)
#define    FL_ADC_ACQ_TRGI_EPWM0SOCB                              (0xdU << 4U)
#define    FL_ADC_ACQ_TRGI_EPWM1SOCA                              (0xeU << 4U)
#define    FL_ADC_ACQ_TRGI_EPWM1SOCB                              (0xfU << 4U)
#define    FL_ADC_ACQ_TRGI_EPWM2SOCA                              (0x10U << 4U)
#define    FL_ADC_ACQ_TRGI_EPWM2SOCB                              (0x11U << 4U)
#define    FL_ADC_ACQ_TRGI_EPWM3SOCA                              (0x12U << 4U)
#define    FL_ADC_ACQ_TRGI_EPWM3SOCB                              (0x13U << 4U)
#define    FL_ADC_ACQ_TRGI_COMP0_TRGO                             (0x14U << 4U)
#define    FL_ADC_ACQ_TRGI_COMP1_TRGO                             (0x15U << 4U)
#define    FL_ADC_ACQ_TRGI_COMP2_TRGO                             (0x16U << 4U)
#define    FL_ADC_ACQ_TRGI_LPTIM0_TRGO                            (0x17U << 4U)
#define    FL_ADC_ACQ_TRGI_BSTIM0_TRGO                            (0x18U << 4U)
#define    FL_ADC_ACQ_SAMPLING_TIME_1_ADCCLK                      (0x0U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_2_ADCCLK                      (0x1U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_4_ADCCLK                      (0x2U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_8_ADCCLK                      (0x3U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_12_ADCCLK                     (0x4U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_16_ADCCLK                     (0x5U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_32_ADCCLK                     (0x6U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_64_ADCCLK                     (0x7U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_80_ADCCLK                     (0x8U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_96_ADCCLK                     (0x9U << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_128_ADCCLK                    (0xaU << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_160_ADCCLK                    (0xbU << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_192_ADCCLK                    (0xcU << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_256_ADCCLK                    (0xdU << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_320_ADCCLK                    (0xeU << 0U)
#define    FL_ADC_ACQ_SAMPLING_TIME_512_ADCCLK                    (0xfU << 0U)

#define    FL_ADC_SYNC_MODE_ASYNC                                 (0x0U << ADC_CFGR1_SYNC_MODE_Pos)
#define    FL_ADC_SYNC_MODE_SYNC                                  (0x1U << ADC_CFGR1_SYNC_MODE_Pos)

