waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_adc.h
#define    FL_ADC_INJ_MODE_DELAY                                  (0x0U << ADC_CFGR1_INJ_MODE_Pos)
#define    FL_ADC_INJ_MODE_IMMEDIA                                (0x1U << ADC_CFGR1_INJ_MODE_Pos)

#define    FL_ADC_Negative_Peference_VSSA                         (0x0U << ADC_CFGR1_REFNSEL_Pos)
#define    FL_ADC_Negative_Peference_VREFN                        (0x1U << ADC_CFGR1_REFNSEL_Pos)

#define    FL_ADC_REF_SOURCE_VDDA                                 (0x0U << ADC_CFGR1_PEFSEL_Pos)
#define    FL_ADC_REF_SOURCE_VREFP                                (0x1U << ADC_CFGR1_PEFSEL_Pos)

#define    FL_ADC_OVERSAMPLING_MUL_2X                             (0x0U << ADC_CFGR2_AVGR_Pos)
#define    FL_ADC_OVERSAMPLING_MUL_4X                             (0x1U << ADC_CFGR2_AVGR_Pos)
#define    FL_ADC_OVERSAMPLING_MUL_8X                             (0x2U << ADC_CFGR2_AVGR_Pos)
#define    FL_ADC_OVERSAMPLING_MUL_16X                            (0x3U << ADC_CFGR2_AVGR_Pos)

#define    FL_ADC_OVERSAMPLING_MODE_DISABLE                       (0x0U << ADC_CFGR2_AVGEN_Pos)
#define    FL_ADC_OVERSAMPLING_MODE_ENABLE_AVERAGE                (0x1U << ADC_CFGR2_AVGEN_Pos)

#define    FL_ADC_TRIGER_MODE_NOMAL                               (0x0U << ADC_CFGR2_TMOD_Pos)
#define    FL_ADC_TRIGER_MODE_ONE_SHOT                            (0x1U << ADC_CFGR2_TMOD_Pos)
#define    FL_ADC_TRIGER_MODE_CONTINUOUS                          (0x2U << ADC_CFGR2_TMOD_Pos)

#define    FL_ADC_INJECTION_CONTROL_NONE                          (0x0U << ADC_PRICR_INJC_Pos)
#define    FL_ADC_INJECTION_CONTROL_ACQ0                          (0x1U << ADC_PRICR_INJC_Pos)
#define    FL_ADC_INJECTION_CONTROL_ACQ0_TO_1                     (0x2U << ADC_PRICR_INJC_Pos)
#define    FL_ADC_INJECTION_CONTROL_ACQ0_TO_2                     (0x3U << ADC_PRICR_INJC_Pos)
#define    FL_ADC_INJECTION_CONTROL_ACQ0_TO_3                     (0x4U << ADC_PRICR_INJC_Pos)
#define    FL_ADC_INJECTION_CONTROL_ACQ0_TO_4                     (0x5U << ADC_PRICR_INJC_Pos)
#define    FL_ADC_INJECTION_CONTROL_ACQ0_TO_5                     (0x6U << ADC_PRICR_INJC_Pos)
#define    FL_ADC_INJECTION_CONTROL_ACQ0_TO_6                     (0x7U << ADC_PRICR_INJC_Pos)
#define    FL_ADC_INJECTION_CONTROL_ACQ0_TO_7                     (0x8U << ADC_PRICR_INJC_Pos)

#define    FL_ADC_DUAL14_MODE_DISABLE                             (0x0U << ADC_DMR_DM14_Pos)
#define    FL_ADC_DUAL14_MODE_ENABLE                              (0x1U << ADC_DMR_DM14_Pos)

#define    FL_ADC_DUAL12_MODE_DISABLE                             (0x0U << ADC_DMR_DM12_Pos)
#define    FL_ADC_DUAL12_MODE_ENABLE                              (0x1U << ADC_DMR_DM12_Pos)

#define    FL_ADC_DUAL10_MODE_DISABLE                             (0x0U << ADC_DMR_DM10_Pos)
#define    FL_ADC_DUAL10_MODE_ENABLE                              (0x1U << ADC_DMR_DM10_Pos)

#define    FL_ADC_DUAL8_MODE_DISABLE                              (0x0U << ADC_DMR_DM8_Pos)
#define    FL_ADC_DUAL8_MODE_ENABLE                               (0x1U << ADC_DMR_DM8_Pos)

#define    FL_ADC_DUAL6_MODE_DISABLE                              (0x0U << ADC_DMR_DM6_Pos)
#define    FL_ADC_DUAL6_MODE_ENABLE                               (0x1U << ADC_DMR_DM6_Pos)

#define    FL_ADC_DUAL4_MODE_DISABLE                              (0x0U << ADC_DMR_DM4_Pos)
#define    FL_ADC_DUAL4_MODE_ENABLE                               (0x1U << ADC_DMR_DM4_Pos)

#define    FL_ADC_DUAL2_MODE_DISABLE                              (0x0U << ADC_DMR_DM2_Pos)
#define    FL_ADC_DUAL2_MODE_ENABLE                               (0x1U << ADC_DMR_DM2_Pos)

#define    FL_ADC_DUAL0_MODE_DISABLE                              (0x0U << ADC_DMR_DM0_Pos)
#define    FL_ADC_DUAL0_MODE_ENABLE                               (0x1U << ADC_DMR_DM0_Pos)

#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA0                    (0x0U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA1                    (0x1U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA2                    (0x2U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA3                    (0x3U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA4                    (0x4U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA5                    (0x5U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA6                    (0x6U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA7                    (0x7U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA8_OPA0_OUT           (0x8U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_TS                          (0x9U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_AVREF                       (0xaU << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_P_CALIBRATION               (0xcU << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB0                    (0x10U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB1                    (0x11U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB2                    (0x12U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB3                    (0x13U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB4                    (0x14U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB5                    (0x15U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB6                    (0x16U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB7                    (0x17U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB8_OPA1_OUT           (0x18U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_VBAT_DIV3                  (0x19U << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_DAC1_OUT1                   (0x1aU << ADC_ACQ0_CR_CHSEL_Pos)
#define    FL_ADC_ACQ0_SELECT_CHANNEL_N_CALIBRATION               (0x1cU << ADC_ACQ0_CR_CHSEL_Pos)

#define    FL_ADC_ACQ0_TRGI_SOFE_TRG                              (0x0U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_LUT0_TRG                              (0x1U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_LUT1_TRG                              (0x2U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_LUT2_TRG                              (0x3U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_LUT3_TRG                              (0x4U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_ATIM0_TRGO                            (0x5U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_ATIM1_TRGO                            (0x6U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_ATIM0_TRGO2                           (0x7U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_ATIM1_TRGO2                           (0x8U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_GPTIM0_TRGO                           (0x9U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_GPTIM1_TRGO                           (0xaU << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_GPTIM2_TRGO                           (0xbU << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_EPWM0SOCA                             (0xcU << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_EPWM0SOCB                             (0xdU << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_EPWM1SOCA                             (0xeU << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_EPWM1SOCB                             (0xfU << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_EPWM2SOCA                             (0x10U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_EPWM2SOCB                             (0x11U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_EPWM3SOCA                             (0x12U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_EPWM3SOCB                             (0x13U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_COMP0_TRGO                            (0x14U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_COMP1_TRGO                            (0x15U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_COMP2_TRGO                            (0x16U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_LPTIM0_TRGO                           (0x17U << ADC_ACQ0_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ0_TRGI_BSTIM0_TRGO                           (0x18U << ADC_ACQ0_CR_TRIGSEL_Pos)

#define    FL_ADC_ACQ0_SAMPLING_TIME_1_ADCCLK                     (0x0U << ADC_ACQ0_CR_SMTS_Pos)
#define    FL_ADC_ACQ0_SAMPLING_TIME_2_ADCCLK                     (0x1U << ADC_ACQ0_CR_SMTS_Pos)
#define    FL_ADC_ACQ0_SAMPLING_TIME_4_ADCCLK                     (0x2U << ADC_ACQ0_CR_SMTS_Pos)
#define    FL_ADC_ACQ0_SAMPLING_TIME_8_ADCCLK                     (0x3U << ADC_ACQ0_CR_SMTS_Pos)
#define    FL_ADC_ACQ0_SAMPLING_TIME_12_ADCCLK                    (0x4U << ADC_ACQ0_CR_SMTS_Pos)
#define    FL_ADC_ACQ0_SAMPLING_TIME_16_ADCCLK                    (0x5U << ADC_ACQ0_CR_SMTS_Pos)
#define    FL_ADC_ACQ0_SAMPLING_TIME_32_ADCCLK                    (0x6U << ADC_ACQ0_CR_SMTS_Pos)
#define    FL_ADC_ACQ0_SAMPLING_TIME_64_ADCCLK                    (0x7U << ADC_ACQ0_CR_SMTS_Pos)
#define    FL_ADC_ACQ0_SAMPLING_TIME_80_ADCCLK                    (0x8U << ADC_ACQ0_CR_SMTS_Pos)
#define    FL_ADC_ACQ0_SAMPLING_TIME_96_ADCCLK                    (0x9U << ADC_ACQ0_CR_SMTS_Pos)
#define    FL_ADC_ACQ0_SAMPLING_TIME_128_ADCCLK                   (0xaU << ADC_ACQ0_CR_SMTS_Pos)
#define    FL_ADC_ACQ0_SAMPLING_TIME_160_ADCCLK                   (0xbU << ADC_ACQ0_CR_SMTS_Pos)
#define    FL_ADC_ACQ0_SAMPLING_TIME_192_ADCCLK                   (0xcU << ADC_ACQ0_CR_SMTS_Pos)
#define    FL_ADC_ACQ0_SAMPLING_TIME_256_ADCCLK                   (0xdU << ADC_ACQ0_CR_SMTS_Pos)
#define    FL_ADC_ACQ0_SAMPLING_TIME_320_ADCCLK                   (0xeU << ADC_ACQ0_CR_SMTS_Pos)
#define    FL_ADC_ACQ0_SAMPLING_TIME_512_ADCCLK                   (0xfU << ADC_ACQ0_CR_SMTS_Pos)

#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA0                    (0x0U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA1                    (0x1U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA2                    (0x2U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA3                    (0x3U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA4                    (0x4U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA5                    (0x5U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA6                    (0x6U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA7                    (0x7U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB8_OPA0_OUT           (0x8U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_TS                          (0x9U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_AVREF                       (0xaU << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_P_CALIBRATION               (0xcU << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB0                    (0x10U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB1                    (0x11U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB2                    (0x12U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB3                    (0x13U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB4                    (0x14U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB5                    (0x15U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB6                    (0x16U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB7                    (0x17U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB8_OPA1_OUT           (0x18U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_VBAT_DIV3                  (0x19U << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_DAC1_OUT1                   (0x1aU << ADC_ACQ1_CR_CHSEL_Pos)
#define    FL_ADC_ACQ1_SELECT_CHANNEL_N_CALIBRATION               (0x1cU << ADC_ACQ1_CR_CHSEL_Pos)

#define    FL_ADC_ACQ1_TRGI_SOFE_TRG                              (0x0U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_LUT0_TRG                              (0x1U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_LUT1_TRG                              (0x2U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_LUT2_TRG                              (0x3U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_LUT3_TRG                              (0x4U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_ATIM0_TRGO                            (0x5U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_ATIM1_TRGO                            (0x6U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_ATIM0_TRGO2                           (0x7U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_ATIM1_TRGO2                           (0x8U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_GPTIM0_TRGO                           (0x9U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_GPTIM1_TRGO                           (0xaU << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_GPTIM2_TRGO                           (0xbU << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_EPWM0SOCA                             (0xcU << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_EPWM0SOCB                             (0xdU << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_EPWM1SOCA                             (0xeU << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_EPWM1SOCB                             (0xfU << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_EPWM2SOCA                             (0x10U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_EPWM2SOCB                             (0x11U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_EPWM3SOCA                             (0x12U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_EPWM3SOCB                             (0x13U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_COMP0_TRGO                            (0x14U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_COMP1_TRGO                            (0x15U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_COMP2_TRGO                            (0x16U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_LPTIM0_TRGO                           (0x17U << ADC_ACQ1_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ1_TRGI_BSTIM0_TRGO                           (0x18U << ADC_ACQ1_CR_TRIGSEL_Pos)

#define    FL_ADC_ACQ1_SAMPLING_TIME_1_ADCCLK                     (0x0U << ADC_ACQ1_CR_SMTS_Pos)
#define    FL_ADC_ACQ1_SAMPLING_TIME_2_ADCCLK                     (0x1U << ADC_ACQ1_CR_SMTS_Pos)
#define    FL_ADC_ACQ1_SAMPLING_TIME_4_ADCCLK                     (0x2U << ADC_ACQ1_CR_SMTS_Pos)
#define    FL_ADC_ACQ1_SAMPLING_TIME_8_ADCCLK                     (0x3U << ADC_ACQ1_CR_SMTS_Pos)
#define    FL_ADC_ACQ1_SAMPLING_TIME_12_ADCCLK                    (0x4U << ADC_ACQ1_CR_SMTS_Pos)
#define    FL_ADC_ACQ1_SAMPLING_TIME_16_ADCCLK                    (0x5U << ADC_ACQ1_CR_SMTS_Pos)
#define    FL_ADC_ACQ1_SAMPLING_TIME_32_ADCCLK                    (0x6U << ADC_ACQ1_CR_SMTS_Pos)
#define    FL_ADC_ACQ1_SAMPLING_TIME_64_ADCCLK                    (0x7U << ADC_ACQ1_CR_SMTS_Pos)
#define    FL_ADC_ACQ1_SAMPLING_TIME_80_ADCCLK                    (0x8U << ADC_ACQ1_CR_SMTS_Pos)
#define    FL_ADC_ACQ1_SAMPLING_TIME_96_ADCCLK                    (0x9U << ADC_ACQ1_CR_SMTS_Pos)
#define    FL_ADC_ACQ1_SAMPLING_TIME_128_ADCCLK                   (0xaU << ADC_ACQ1_CR_SMTS_Pos)
#define    FL_ADC_ACQ1_SAMPLING_TIME_160_ADCCLK                   (0xbU << ADC_ACQ1_CR_SMTS_Pos)
#define    FL_ADC_ACQ1_SAMPLING_TIME_192_ADCCLK                   (0xcU << ADC_ACQ1_CR_SMTS_Pos)
#define    FL_ADC_ACQ1_SAMPLING_TIME_256_ADCCLK                   (0xdU << ADC_ACQ1_CR_SMTS_Pos)
#define    FL_ADC_ACQ1_SAMPLING_TIME_320_ADCCLK                   (0xeU << ADC_ACQ1_CR_SMTS_Pos)
#define    FL_ADC_ACQ1_SAMPLING_TIME_512_ADCCLK                   (0xfU << ADC_ACQ1_CR_SMTS_Pos)

#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA0                    (0x0U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA1                    (0x1U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA2                    (0x2U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA3                    (0x3U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA4                    (0x4U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA5                    (0x5U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA6                    (0x6U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA7                    (0x7U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB8_OPA0_OUT           (0x8U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_TS                          (0x9U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_AVREF                       (0xaU << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_P_CALIBRATION               (0xcU << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB0                    (0x10U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB1                    (0x11U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB2                    (0x12U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB3                    (0x13U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB4                    (0x14U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB5                    (0x15U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB6                    (0x16U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB7                    (0x17U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB8_OPA1_OUT           (0x18U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_VBAT_DIV3                  (0x19U << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_DAC1_OUT1                   (0x1aU << ADC_ACQ2_CR_CHSEL_Pos)
#define    FL_ADC_ACQ2_SELECT_CHANNEL_N_CALIBRATION               (0x1cU << ADC_ACQ2_CR_CHSEL_Pos)

#define    FL_ADC_ACQ2_TRGI_SOFE_TRG                              (0x0U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_LUT0_TRG                              (0x1U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_LUT1_TRG                              (0x2U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_LUT2_TRG                              (0x3U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_LUT3_TRG                              (0x4U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_ATIM0_TRGO                            (0x5U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_ATIM1_TRGO                            (0x6U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_ATIM0_TRGO2                           (0x7U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_ATIM1_TRGO2                           (0x8U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_GPTIM0_TRGO                           (0x9U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_GPTIM1_TRGO                           (0xaU << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_GPTIM2_TRGO                           (0xbU << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_EPWM0SOCA                             (0xcU << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_EPWM0SOCB                             (0xdU << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_EPWM1SOCA                             (0xeU << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_EPWM1SOCB                             (0xfU << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_EPWM2SOCA                             (0x10U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_EPWM2SOCB                             (0x11U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_EPWM3SOCA                             (0x12U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_EPWM3SOCB                             (0x13U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_COMP0_TRGO                            (0x14U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_COMP1_TRGO                            (0x15U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_COMP2_TRGO                            (0x16U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_LPTIM0_TRGO                           (0x17U << ADC_ACQ2_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ2_TRGI_BSTIM0_TRGO                           (0x18U << ADC_ACQ2_CR_TRIGSEL_Pos)

#define    FL_ADC_ACQ2_SAMPLING_TIME_1_ADCCLK                     (0x0U << ADC_ACQ2_CR_SMTS_Pos)
#define    FL_ADC_ACQ2_SAMPLING_TIME_2_ADCCLK                     (0x1U << ADC_ACQ2_CR_SMTS_Pos)
#define    FL_ADC_ACQ2_SAMPLING_TIME_4_ADCCLK                     (0x2U << ADC_ACQ2_CR_SMTS_Pos)
#define    FL_ADC_ACQ2_SAMPLING_TIME_8_ADCCLK                     (0x3U << ADC_ACQ2_CR_SMTS_Pos)
#define    FL_ADC_ACQ2_SAMPLING_TIME_12_ADCCLK                    (0x4U << ADC_ACQ2_CR_SMTS_Pos)
#define    FL_ADC_ACQ2_SAMPLING_TIME_16_ADCCLK                    (0x5U << ADC_ACQ2_CR_SMTS_Pos)
#define    FL_ADC_ACQ2_SAMPLING_TIME_32_ADCCLK                    (0x6U << ADC_ACQ2_CR_SMTS_Pos)
#define    FL_ADC_ACQ2_SAMPLING_TIME_64_ADCCLK                    (0x7U << ADC_ACQ2_CR_SMTS_Pos)
#define    FL_ADC_ACQ2_SAMPLING_TIME_80_ADCCLK                    (0x8U << ADC_ACQ2_CR_SMTS_Pos)
#define    FL_ADC_ACQ2_SAMPLING_TIME_96_ADCCLK                    (0x9U << ADC_ACQ2_CR_SMTS_Pos)
#define    FL_ADC_ACQ2_SAMPLING_TIME_128_ADCCLK                   (0xaU << ADC_ACQ2_CR_SMTS_Pos)
#define    FL_ADC_ACQ2_SAMPLING_TIME_160_ADCCLK                   (0xbU << ADC_ACQ2_CR_SMTS_Pos)
#define    FL_ADC_ACQ2_SAMPLING_TIME_192_ADCCLK                   (0xcU << ADC_ACQ2_CR_SMTS_Pos)
#define    FL_ADC_ACQ2_SAMPLING_TIME_256_ADCCLK                   (0xdU << ADC_ACQ2_CR_SMTS_Pos)
#define    FL_ADC_ACQ2_SAMPLING_TIME_320_ADCCLK                   (0xeU << ADC_ACQ2_CR_SMTS_Pos)
#define    FL_ADC_ACQ2_SAMPLING_TIME_512_ADCCLK                   (0xfU << ADC_ACQ2_CR_SMTS_Pos)

