waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_adc.h
#define    FL_ADC_ACQ10_TRGI_SOFE_TRG                             (0x0U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_LUT0_TRG                             (0x1U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_LUT1_TRG                             (0x2U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_LUT2_TRG                             (0x3U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_LUT3_TRG                             (0x4U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_ATIM0_TRGO                           (0x5U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_ATIM1_TRGO                           (0x6U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_ATIM0_TRGO2                          (0x7U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_ATIM1_TRGO2                          (0x8U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_GPTIM0_TRGO                          (0x9U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_GPTIM1_TRGO                          (0xaU << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_GPTIM2_TRGO                          (0xbU << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_EPWM0SOCA                            (0xcU << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_EPWM0SOCB                            (0xdU << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_EPWM1SOCA                            (0xeU << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_EPWM1SOCB                            (0xfU << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_EPWM2SOCA                            (0x10U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_EPWM2SOCB                            (0x11U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_EPWM3SOCA                            (0x12U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_EPWM3SOCB                            (0x13U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_COMP0_TRGO                           (0x14U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_COMP1_TRGO                           (0x15U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_COMP2_TRGO                           (0x16U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_LPTIM0_TRGO                          (0x17U << ADC_ACQ10_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ10_TRGI_BSTIM0_TRGO                          (0x18U << ADC_ACQ10_CR_TRIGSEL_Pos)

#define    FL_ADC_ACQ10_SAMPLING_TIME_1_ADCCLK                    (0x0U << ADC_ACQ10_CR_SMTS_Pos)
#define    FL_ADC_ACQ10_SAMPLING_TIME_2_ADCCLK                    (0x1U << ADC_ACQ10_CR_SMTS_Pos)
#define    FL_ADC_ACQ10_SAMPLING_TIME_4_ADCCLK                    (0x2U << ADC_ACQ10_CR_SMTS_Pos)
#define    FL_ADC_ACQ10_SAMPLING_TIME_8_ADCCLK                    (0x3U << ADC_ACQ10_CR_SMTS_Pos)
#define    FL_ADC_ACQ10_SAMPLING_TIME_12_ADCCLK                   (0x4U << ADC_ACQ10_CR_SMTS_Pos)
#define    FL_ADC_ACQ10_SAMPLING_TIME_16_ADCCLK                   (0x5U << ADC_ACQ10_CR_SMTS_Pos)
#define    FL_ADC_ACQ10_SAMPLING_TIME_32_ADCCLK                   (0x6U << ADC_ACQ10_CR_SMTS_Pos)
#define    FL_ADC_ACQ10_SAMPLING_TIME_64_ADCCLK                   (0x7U << ADC_ACQ10_CR_SMTS_Pos)
#define    FL_ADC_ACQ10_SAMPLING_TIME_80_ADCCLK                   (0x8U << ADC_ACQ10_CR_SMTS_Pos)
#define    FL_ADC_ACQ10_SAMPLING_TIME_96_ADCCLK                   (0x9U << ADC_ACQ10_CR_SMTS_Pos)
#define    FL_ADC_ACQ10_SAMPLING_TIME_128_ADCCLK                  (0xaU << ADC_ACQ10_CR_SMTS_Pos)
#define    FL_ADC_ACQ10_SAMPLING_TIME_160_ADCCLK                  (0xbU << ADC_ACQ10_CR_SMTS_Pos)
#define    FL_ADC_ACQ10_SAMPLING_TIME_192_ADCCLK                  (0xcU << ADC_ACQ10_CR_SMTS_Pos)
#define    FL_ADC_ACQ10_SAMPLING_TIME_256_ADCCLK                  (0xdU << ADC_ACQ10_CR_SMTS_Pos)
#define    FL_ADC_ACQ10_SAMPLING_TIME_320_ADCCLK                  (0xeU << ADC_ACQ10_CR_SMTS_Pos)
#define    FL_ADC_ACQ10_SAMPLING_TIME_512_ADCCLK                  (0xfU << ADC_ACQ10_CR_SMTS_Pos)

#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA0                   (0x0U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA1                   (0x1U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA2                   (0x2U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA3                   (0x3U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA4                   (0x4U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA5                   (0x5U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA6                   (0x6U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA7                   (0x7U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB8_OPA0_OUT          (0x8U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_TS                         (0x9U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_AVREF                      (0xaU << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_P_CALIBRATION              (0xcU << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB0                   (0x10U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB1                   (0x11U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB2                   (0x12U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB3                   (0x13U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB4                   (0x14U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB5                   (0x15U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB6                   (0x16U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB7                   (0x17U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB8_OPA1_OUT          (0x18U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_VBAT_DIV3                 (0x19U << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_DAC1_OUT1                  (0x1aU << ADC_ACQ11_CR_CHSEL_Pos)
#define    FL_ADC_ACQ11_SELECT_CHANNEL_N_CALIBRATION              (0x1cU << ADC_ACQ11_CR_CHSEL_Pos)

#define    FL_ADC_ACQ11_TRGI_SOFE_TRG                             (0x0U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_LUT0_TRG                             (0x1U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_LUT1_TRG                             (0x2U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_LUT2_TRG                             (0x3U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_LUT3_TRG                             (0x4U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_ATIM0_TRGO                           (0x5U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_ATIM1_TRGO                           (0x6U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_ATIM0_TRGO2                          (0x7U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_ATIM1_TRGO2                          (0x8U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_GPTIM0_TRGO                          (0x9U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_GPTIM1_TRGO                          (0xaU << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_GPTIM2_TRGO                          (0xbU << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_EPWM0SOCA                            (0xcU << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_EPWM0SOCB                            (0xdU << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_EPWM1SOCA                            (0xeU << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_EPWM1SOCB                            (0xfU << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_EPWM2SOCA                            (0x10U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_EPWM2SOCB                            (0x11U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_EPWM3SOCA                            (0x12U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_EPWM3SOCB                            (0x13U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_COMP0_TRGO                           (0x14U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_COMP1_TRGO                           (0x15U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_COMP2_TRGO                           (0x16U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_LPTIM0_TRGO                          (0x17U << ADC_ACQ11_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ11_TRGI_BSTIM0_TRGO                          (0x18U << ADC_ACQ11_CR_TRIGSEL_Pos)

#define    FL_ADC_ACQ11_SAMPLING_TIME_1_ADCCLK                    (0x0U << ADC_ACQ11_CR_SMTS_Pos)
#define    FL_ADC_ACQ11_SAMPLING_TIME_2_ADCCLK                    (0x1U << ADC_ACQ11_CR_SMTS_Pos)
#define    FL_ADC_ACQ11_SAMPLING_TIME_4_ADCCLK                    (0x2U << ADC_ACQ11_CR_SMTS_Pos)
#define    FL_ADC_ACQ11_SAMPLING_TIME_8_ADCCLK                    (0x3U << ADC_ACQ11_CR_SMTS_Pos)
#define    FL_ADC_ACQ11_SAMPLING_TIME_12_ADCCLK                   (0x4U << ADC_ACQ11_CR_SMTS_Pos)
#define    FL_ADC_ACQ11_SAMPLING_TIME_16_ADCCLK                   (0x5U << ADC_ACQ11_CR_SMTS_Pos)
#define    FL_ADC_ACQ11_SAMPLING_TIME_32_ADCCLK                   (0x6U << ADC_ACQ11_CR_SMTS_Pos)
#define    FL_ADC_ACQ11_SAMPLING_TIME_64_ADCCLK                   (0x7U << ADC_ACQ11_CR_SMTS_Pos)
#define    FL_ADC_ACQ11_SAMPLING_TIME_80_ADCCLK                   (0x8U << ADC_ACQ11_CR_SMTS_Pos)
#define    FL_ADC_ACQ11_SAMPLING_TIME_96_ADCCLK                   (0x9U << ADC_ACQ11_CR_SMTS_Pos)
#define    FL_ADC_ACQ11_SAMPLING_TIME_128_ADCCLK                  (0xaU << ADC_ACQ11_CR_SMTS_Pos)
#define    FL_ADC_ACQ11_SAMPLING_TIME_160_ADCCLK                  (0xbU << ADC_ACQ11_CR_SMTS_Pos)
#define    FL_ADC_ACQ11_SAMPLING_TIME_192_ADCCLK                  (0xcU << ADC_ACQ11_CR_SMTS_Pos)
#define    FL_ADC_ACQ11_SAMPLING_TIME_256_ADCCLK                  (0xdU << ADC_ACQ11_CR_SMTS_Pos)
#define    FL_ADC_ACQ11_SAMPLING_TIME_320_ADCCLK                  (0xeU << ADC_ACQ11_CR_SMTS_Pos)
#define    FL_ADC_ACQ11_SAMPLING_TIME_512_ADCCLK                  (0xfU << ADC_ACQ11_CR_SMTS_Pos)

#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA0                   (0x0U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA1                   (0x1U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA2                   (0x2U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA3                   (0x3U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA4                   (0x4U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA5                   (0x5U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA6                   (0x6U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA7                   (0x7U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB8_OPA0_OUT          (0x8U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_TS                         (0x9U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_AVREF                      (0xaU << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_P_CALIBRATION              (0xcU << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB0                   (0x10U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB1                   (0x11U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB2                   (0x12U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB3                   (0x13U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB4                   (0x14U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB5                   (0x15U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB6                   (0x16U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB7                   (0x17U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB8_OPA1_OUT          (0x18U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_VBAT_DIV3                 (0x19U << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_DAC1_OUT1                  (0x1aU << ADC_ACQ12_CR_CHSEL_Pos)
#define    FL_ADC_ACQ12_SELECT_CHANNEL_N_CALIBRATION              (0x1cU << ADC_ACQ12_CR_CHSEL_Pos)

