waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_adc.h
#define    FL_ADC_ACQ14_SAMPLING_TIME_1_ADCCLK                    (0x0U << ADC_ACQ14_CR_SMTS_Pos)
#define    FL_ADC_ACQ14_SAMPLING_TIME_2_ADCCLK                    (0x1U << ADC_ACQ14_CR_SMTS_Pos)
#define    FL_ADC_ACQ14_SAMPLING_TIME_4_ADCCLK                    (0x2U << ADC_ACQ14_CR_SMTS_Pos)
#define    FL_ADC_ACQ14_SAMPLING_TIME_8_ADCCLK                    (0x3U << ADC_ACQ14_CR_SMTS_Pos)
#define    FL_ADC_ACQ14_SAMPLING_TIME_12_ADCCLK                   (0x4U << ADC_ACQ14_CR_SMTS_Pos)
#define    FL_ADC_ACQ14_SAMPLING_TIME_16_ADCCLK                   (0x5U << ADC_ACQ14_CR_SMTS_Pos)
#define    FL_ADC_ACQ14_SAMPLING_TIME_32_ADCCLK                   (0x6U << ADC_ACQ14_CR_SMTS_Pos)
#define    FL_ADC_ACQ14_SAMPLING_TIME_64_ADCCLK                   (0x7U << ADC_ACQ14_CR_SMTS_Pos)
#define    FL_ADC_ACQ14_SAMPLING_TIME_80_ADCCLK                   (0x8U << ADC_ACQ14_CR_SMTS_Pos)
#define    FL_ADC_ACQ14_SAMPLING_TIME_96_ADCCLK                   (0x9U << ADC_ACQ14_CR_SMTS_Pos)
#define    FL_ADC_ACQ14_SAMPLING_TIME_128_ADCCLK                  (0xaU << ADC_ACQ14_CR_SMTS_Pos)
#define    FL_ADC_ACQ14_SAMPLING_TIME_160_ADCCLK                  (0xbU << ADC_ACQ14_CR_SMTS_Pos)
#define    FL_ADC_ACQ14_SAMPLING_TIME_192_ADCCLK                  (0xcU << ADC_ACQ14_CR_SMTS_Pos)
#define    FL_ADC_ACQ14_SAMPLING_TIME_256_ADCCLK                  (0xdU << ADC_ACQ14_CR_SMTS_Pos)
#define    FL_ADC_ACQ14_SAMPLING_TIME_320_ADCCLK                  (0xeU << ADC_ACQ14_CR_SMTS_Pos)
#define    FL_ADC_ACQ14_SAMPLING_TIME_512_ADCCLK                  (0xfU << ADC_ACQ14_CR_SMTS_Pos)

#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA0                   (0x0U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA1                   (0x1U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA2                   (0x2U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA3                   (0x3U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA4                   (0x4U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA5                   (0x5U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA6                   (0x6U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA7                   (0x7U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB8_OPA0_OUT          (0x8U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_TS                         (0x9U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_AVREF                      (0xaU << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_P_CALIBRATION              (0xcU << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB0                   (0x10U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB1                   (0x11U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB2                   (0x12U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB3                   (0x13U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB4                   (0x14U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB5                   (0x15U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB6                   (0x16U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB7                   (0x17U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB8_OPA1_OUT          (0x18U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_VBAT_DIV3                 (0x19U << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_DAC1_OUT1                  (0x1aU << ADC_ACQ15_CR_CHSEL_Pos)
#define    FL_ADC_ACQ15_SELECT_CHANNEL_N_CALIBRATION              (0x1cU << ADC_ACQ15_CR_CHSEL_Pos)

#define    FL_ADC_ACQ15_TRGI_SOFE_TRG                             (0x0U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_LUT0_TRG                             (0x1U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_LUT1_TRG                             (0x2U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_LUT2_TRG                             (0x3U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_LUT3_TRG                             (0x4U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_ATIM0_TRGO                           (0x5U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_ATIM1_TRGO                           (0x6U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_ATIM0_TRGO2                          (0x7U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_ATIM1_TRGO2                          (0x8U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_GPTIM0_TRGO                          (0x9U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_GPTIM1_TRGO                          (0xaU << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_GPTIM2_TRGO                          (0xbU << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_EPWM0SOCA                            (0xcU << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_EPWM0SOCB                            (0xdU << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_EPWM1SOCA                            (0xeU << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_EPWM1SOCB                            (0xfU << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_EPWM2SOCA                            (0x10U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_EPWM2SOCB                            (0x11U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_EPWM3SOCA                            (0x12U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_EPWM3SOCB                            (0x13U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_COMP0_TRGO                           (0x14U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_COMP1_TRGO                           (0x15U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_COMP2_TRGO                           (0x16U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_LPTIM0_TRGO                          (0x17U << ADC_ACQ15_CR_TRIGSEL_Pos)
#define    FL_ADC_ACQ15_TRGI_BSTIM0_TRGO                          (0x18U << ADC_ACQ15_CR_TRIGSEL_Pos)

#define    FL_ADC_ACQ15_SAMPLING_TIME_1_ADCCLK                    (0x0U << ADC_ACQ15_CR_SMTS_Pos)
#define    FL_ADC_ACQ15_SAMPLING_TIME_2_ADCCLK                    (0x1U << ADC_ACQ15_CR_SMTS_Pos)
#define    FL_ADC_ACQ15_SAMPLING_TIME_4_ADCCLK                    (0x2U << ADC_ACQ15_CR_SMTS_Pos)
#define    FL_ADC_ACQ15_SAMPLING_TIME_8_ADCCLK                    (0x3U << ADC_ACQ15_CR_SMTS_Pos)
#define    FL_ADC_ACQ15_SAMPLING_TIME_12_ADCCLK                   (0x4U << ADC_ACQ15_CR_SMTS_Pos)
#define    FL_ADC_ACQ15_SAMPLING_TIME_16_ADCCLK                   (0x5U << ADC_ACQ15_CR_SMTS_Pos)
#define    FL_ADC_ACQ15_SAMPLING_TIME_32_ADCCLK                   (0x6U << ADC_ACQ15_CR_SMTS_Pos)
#define    FL_ADC_ACQ15_SAMPLING_TIME_64_ADCCLK                   (0x7U << ADC_ACQ15_CR_SMTS_Pos)
#define    FL_ADC_ACQ15_SAMPLING_TIME_80_ADCCLK                   (0x8U << ADC_ACQ15_CR_SMTS_Pos)
#define    FL_ADC_ACQ15_SAMPLING_TIME_96_ADCCLK                   (0x9U << ADC_ACQ15_CR_SMTS_Pos)
#define    FL_ADC_ACQ15_SAMPLING_TIME_128_ADCCLK                  (0xaU << ADC_ACQ15_CR_SMTS_Pos)
#define    FL_ADC_ACQ15_SAMPLING_TIME_160_ADCCLK                  (0xbU << ADC_ACQ15_CR_SMTS_Pos)
#define    FL_ADC_ACQ15_SAMPLING_TIME_192_ADCCLK                  (0xcU << ADC_ACQ15_CR_SMTS_Pos)
#define    FL_ADC_ACQ15_SAMPLING_TIME_256_ADCCLK                  (0xdU << ADC_ACQ15_CR_SMTS_Pos)
#define    FL_ADC_ACQ15_SAMPLING_TIME_320_ADCCLK                  (0xeU << ADC_ACQ15_CR_SMTS_Pos)
#define    FL_ADC_ACQ15_SAMPLING_TIME_512_ADCCLK                  (0xfU << ADC_ACQ15_CR_SMTS_Pos)

/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup ADC_FL_Exported_Functions ADC Exported Functions
  * @{
  */

/**
  * @brief    Get ADC Data Overrun Flag
  * @rmtoll   ACQ_ISR    OVR    FL_ADC_IsActiveFlag_Overrun
  * @param    ADCx ADC instance
  * @param    acqx_ovr This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsActiveFlag_Overrun(ADC_Type *ADCx, uint32_t acqx_ovr)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ_ISR, ((acqx_ovr & 0xffff) << 0x10U)) == ((acqx_ovr & 0xffff) << 0x10U));
}

/**
  * @brief    Clear ADC  Data Overrun Flag
  * @rmtoll   ACQ_ISR    OVR    FL_ADC_ClearFlag_Overrun
  * @param    ADCx ADC instance
  * @param    acqx_ovr This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_ClearFlag_Overrun(ADC_Type *ADCx, uint32_t acqx_ovr)
{
    SET_BIT(ADCx->ACQ_ISR, ((acqx_ovr & 0xffff) << 0x10U));
}

/**
  * @brief    Get ADC End Of Conversion Flag
  * @rmtoll   ACQ_ISR    EOC    FL_ADC_IsActiveFlag_EndOfConversion
  * @param    ADCx ADC instance
  * @param    acqx_eoc This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsActiveFlag_EndOfConversion(ADC_Type *ADCx, uint32_t acqx_eoc)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ_ISR, ((acqx_eoc & 0xffff) << 0x0U)) == ((acqx_eoc & 0xffff) << 0x0U));
}

/**
  * @brief    Clear ADC End Of Conversion Flag
  * @rmtoll   ACQ_ISR    EOC    FL_ADC_ClearFlag_EndOfConversion
  * @param    ADCx ADC instance
  * @param    acqx_eoc This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_ClearFlag_EndOfConversion(ADC_Type *ADCx, uint32_t acqx_eoc)
{
    SET_BIT(ADCx->ACQ_ISR, ((acqx_eoc & 0xffff) << 0x0U));
}

/**
  * @brief    Enable ADC Data Overrun interrupt
  * @rmtoll   ACQ_IER    OVRIE    FL_ADC_EnableIT_Overrun
  * @param    ADCx ADC instance
  * @param    acqx_ovr This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableIT_Overrun(ADC_Type *ADCx, uint32_t acqx_ovr)
{
    SET_BIT(ADCx->ACQ_IER, ((acqx_ovr & 0xffff) << 0x10U));
}

/**
  * @brief    Disable ADC Data Overrun interrupt
  * @rmtoll   ACQ_IER    OVRIE    FL_ADC_DisableIT_Overrun
  * @param    ADCx ADC instance
  * @param    acqx_ovr This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_DisableIT_Overrun(ADC_Type *ADCx, uint32_t acqx_ovr)
{
    CLEAR_BIT(ADCx->ACQ_IER, ((acqx_ovr & 0xffff) << 0x10U));
}

/**
  * @brief    Get ADC Data Overrun interrupt Enable Status
  * @rmtoll   ACQ_IER    OVRIE    FL_ADC_IsEnabledIT_Overrun
  * @param    ADCx ADC instance
  * @param    acqx_ovr This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabledIT_Overrun(ADC_Type *ADCx, uint32_t acqx_ovr)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ_IER, ((acqx_ovr & 0xffff) << 0x10U)) == ((acqx_ovr & 0xffff) << 0x10U));
}

/**
  * @brief    Enable ADC End 0f Conversion interrupt
  * @rmtoll   ACQ_IER    EOCIE    FL_ADC_EnableIT_EndOfConversion
  * @param    ADCx ADC instance
  * @param    acqx_eoc This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableIT_EndOfConversion(ADC_Type *ADCx, uint32_t acqx_eoc)
{
    SET_BIT(ADCx->ACQ_IER, ((acqx_eoc & 0xffff) << 0x0U));
}

/**
  * @brief    Disable ADC End 0f Conversion interrupt
  * @rmtoll   ACQ_IER    EOCIE    FL_ADC_DisableIT_EndOfConversion
  * @param    ADCx ADC instance
  * @param    acqx_eoc This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_DisableIT_EndOfConversion(ADC_Type *ADCx, uint32_t acqx_eoc)
{
    CLEAR_BIT(ADCx->ACQ_IER, ((acqx_eoc & 0xffff) << 0x0U));
}

/**
  * @brief    Get ADC End 0f Conversion interrupt Enable Status
  * @rmtoll   ACQ_IER    EOCIE    FL_ADC_IsEnabledIT_EndOfConversion
  * @param    ADCx ADC instance
  * @param    acqx_eoc This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabledIT_EndOfConversion(ADC_Type *ADCx, uint32_t acqx_eoc)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ_IER, ((acqx_eoc & 0xffff) << 0x0U)) == ((acqx_eoc & 0xffff) << 0x0U));
}

/**
  * @brief    Get Working ACQx ID
  * @rmtoll   GISR    ACQ_ID    FL_ADC_GetWorkingACQID
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_GetWorkingACQID(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->GISR, (0x1fU << 4U)) >> 4U);
}

/**
  * @brief    Get ADC Over Speed Flag
  * @rmtoll   GISR    OSF    FL_ADC_IsActiveFlag_OverSpeed
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsActiveFlag_OverSpeed(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->GISR, ADC_GISR_OSF_Msk) == (ADC_GISR_OSF_Msk));
}

/**
  * @brief    Clear ADC Over Speed Flag
  * @rmtoll   GISR    OSF    FL_ADC_ClearFlag_OverSpeed
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_ClearFlag_OverSpeed(ADC_Type *ADCx)
{
    WRITE_REG(ADCx->GISR, ADC_GISR_OSF_Msk);
}

/**
  * @brief    Clear ADC Continuous Mode Complete Flag
  * @rmtoll   GISR    EOCNT    FL_ADC_ClearFlag_ContinuousModeComplete
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_ClearFlag_ContinuousModeComplete(ADC_Type *ADCx)
{
    WRITE_REG(ADCx->GISR, ADC_GISR_EOCNT_Msk);
}

/**
  * @brief    Get ADC Continuous Mode Complete Flag
  * @rmtoll   GISR    EOCNT    FL_ADC_IsActiveFlag_ContinuousModeComplete
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsActiveFlag_ContinuousModeComplete(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->GISR, ADC_GISR_EOCNT_Msk) == (ADC_GISR_EOCNT_Msk));
}

/**
  * @brief    Get ADC Busy Flag
  * @rmtoll   GISR    BUSY    FL_ADC_IsActiveFlag_Busy
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsActiveFlag_Busy(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->GISR, ADC_GISR_BUSY_Msk) == (ADC_GISR_BUSY_Msk));
}

/**
  * @brief    Enable ADC Continuous Mode Complete interrupt
  * @rmtoll   GIER    EOCNTIE    FL_ADC_EnableIT_ContinuousModeComplete
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableIT_ContinuousModeComplete(ADC_Type *ADCx)
{
    SET_BIT(ADCx->GIER, ADC_GIER_EOCNTIE_Msk);
}

/**
  * @brief    Disable ADC Continuous Mode Complete interrupt
  * @rmtoll   GIER    EOCNTIE    FL_ADC_DisableIT_ContinuousModeComplete
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_DisableIT_ContinuousModeComplete(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->GIER, ADC_GIER_EOCNTIE_Msk);
}

/**
  * @brief    Get ADC Continuous Mode Complete interrupt Enable Status
  * @rmtoll   GIER    EOCNTIE    FL_ADC_IsEnabledIT_ContinuousModeComplete
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabledIT_ContinuousModeComplete(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->GIER, ADC_GIER_EOCNTIE_Msk) == ADC_GIER_EOCNTIE_Msk);
}

/**
  * @brief    Enable ACQ
  * @rmtoll   CR1    ACQEN    FL_ADC_EnableACQ
  * @param    ADCx ADC instance
  * @param    acqx_en This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableACQ(ADC_Type *ADCx, uint32_t acqx_en)
{
    SET_BIT(ADCx->CR1, ((acqx_en & 0xffff) << 0x10U));
}

/**
  * @brief    Disable ADC
  * @rmtoll   CR1    ACQEN    FL_ADC_DisableACQ
  * @param    ADCx ADC instance
  * @param    acqx_en This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_DisableACQ(ADC_Type *ADCx, uint32_t acqx_en)
{
    CLEAR_BIT(ADCx->CR1, ((acqx_en & 0xffff) << 0x10U));
}

