waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_adc.h
/**
  * @brief    Get ADC Enable Status
  * @rmtoll   CR1    ACQEN    FL_ADC_IsEnabledACQ
  * @param    ADCx ADC instance
  * @param    acqx_en This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabledACQ(ADC_Type *ADCx, uint32_t acqx_en)
{
    return (uint32_t)(READ_BIT(ADCx->CR1, ((acqx_en & 0xffff) << 0x10U)) == ((acqx_en & 0xffff) << 0x10U));
}

/**
  * @brief    Enable Round Robin Reset
  * @rmtoll   CR1    RR_SWRST    FL_ADC_EnableRoundRobinReset
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableRoundRobinReset(ADC_Type *ADCx)
{
    SET_BIT(ADCx->CR1, ADC_CR1_RR_SWRST_Msk);
}

/**
  * @brief    Enable ADC
  * @rmtoll   CR1    ADEN    FL_ADC_Enable
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_Enable(ADC_Type *ADCx)
{
    SET_BIT(ADCx->CR1, ADC_CR1_ADEN_Msk);
}

/**
  * @brief    Disable ADC
  * @rmtoll   CR1    ADEN    FL_ADC_Disable
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_Disable(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->CR1, ADC_CR1_ADEN_Msk);
}

/**
  * @brief    Get ADC Enable Status
  * @rmtoll   CR1    ADEN    FL_ADC_IsEnabled
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabled(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CR1, ADC_CR1_ADEN_Msk) == ADC_CR1_ADEN_Msk);
}

/**
  * @brief    Enable ACQx Sofeware Triggered Conversion
  * @rmtoll   CR2    SWTRIG    FL_ADC_EnableACQSWConversion
  * @param    ADCx ADC instance
  * @param    acqx_sw This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableACQSWConversion(ADC_Type *ADCx, uint32_t acqx_sw)
{
    SET_BIT(ADCx->CR2, ((acqx_sw & 0xffff) << 0x0U));
}

/**
  * @brief    Set ADC Repeat Length for Continuous Mode
  * @rmtoll   CFGR1    RPTLEN    FL_ADC_SetRepeatLength
  * @param    ADCx ADC instance
  * @param    count
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetRepeatLength(ADC_Type *ADCx, uint32_t count)
{
    MODIFY_REG(ADCx->CFGR1, (0xffffU << 16U), (count << 16U));
}

/**
  * @brief    Read ADC Repeat Length for Continuous Mode
  * @rmtoll   CFGR1    RPTLEN    FL_ADC_GetRepeatLength
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_GetRepeatLength(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR1, (0xffffU << 16U)) >> 16U);
}

/**
  * @brief    Set ADC Conversion Cycle
  * @rmtoll   CFGR1    CONV_CYCLE    FL_ADC_SetConversionCycle
  * @param    ADCx ADC instance
  * @param    cycle
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetConversionCycle(ADC_Type *ADCx, uint32_t cycle)
{
    MODIFY_REG(ADCx->CFGR1, (0xffU << 8U), (cycle << 8U));
}

/**
  * @brief    Read ADC Conversion Cycle
  * @rmtoll   CFGR1    CONV_CYCLE    FL_ADC_GetConversionCycle
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_GetConversionCycle(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR1, (0xffU << 8U)) >> 8U);
}

/**
  * @brief    Set ADC Conversion Mode
  * @rmtoll   CFGR1    SYNC_MODE    FL_ADC_SetConversionMode
  * @param    ADCx ADC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_ADC_SYNC_MODE_ASYNC
  *           @arg @ref FL_ADC_SYNC_MODE_SYNC
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetConversionMode(ADC_Type *ADCx, uint32_t mode)
{
    MODIFY_REG(ADCx->CFGR1, ADC_CFGR1_SYNC_MODE_Msk, mode);
}

/**
  * @brief    Get ADC Conversion Mode
  * @rmtoll   CFGR1    SYNC_MODE    FL_ADC_GetConversionMode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_SYNC_MODE_ASYNC
  *           @arg @ref FL_ADC_SYNC_MODE_SYNC
  */
__STATIC_INLINE uint32_t FL_ADC_GetConversionMode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR1, ADC_CFGR1_SYNC_MODE_Msk));
}

/**
  * @brief    Set ADC Injection Mode
  * @rmtoll   CFGR1    INJ_MODE    FL_ADC_SetInjectionMode
  * @param    ADCx ADC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_ADC_INJ_MODE_DELAY
  *           @arg @ref FL_ADC_INJ_MODE_IMMEDIA
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetInjectionMode(ADC_Type *ADCx, uint32_t mode)
{
    MODIFY_REG(ADCx->CFGR1, ADC_CFGR1_INJ_MODE_Msk, mode);
}

/**
  * @brief    Get ADC Injection Mode
  * @rmtoll   CFGR1    INJ_MODE    FL_ADC_GetInjectionMode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_INJ_MODE_DELAY
  *           @arg @ref FL_ADC_INJ_MODE_IMMEDIA
  */
__STATIC_INLINE uint32_t FL_ADC_GetInjectionMode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR1, ADC_CFGR1_INJ_MODE_Msk));
}

/**
  * @brief    Set ADC Negative Peference
  * @rmtoll   CFGR1    REFNSEL    FL_ADC_SetNegativePeference
  * @param    ADCx ADC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_ADC_Negative_Peference_VSSA
  *           @arg @ref FL_ADC_Negative_Peference_VREFN
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetNegativePeference(ADC_Type *ADCx, uint32_t mode)
{
    MODIFY_REG(ADCx->CFGR1, ADC_CFGR1_REFNSEL_Msk, mode);
}

/**
  * @brief    Read ADC Negative Peference
  * @rmtoll   CFGR1    REFNSEL    FL_ADC_GetNegativePeference
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_Negative_Peference_VSSA
  *           @arg @ref FL_ADC_Negative_Peference_VREFN
  */
__STATIC_INLINE uint32_t FL_ADC_GetNegativePeference(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR1, ADC_CFGR1_REFNSEL_Msk));
}

/**
  * @brief    Set ADC Reference Source
  * @rmtoll   CFGR1    PEFSEL    FL_ADC_SetReferenceSource
  * @param    ADCx ADC instance
  * @param    ref This parameter can be one of the following values:
  *           @arg @ref FL_ADC_REF_SOURCE_VDDA
  *           @arg @ref FL_ADC_REF_SOURCE_VREFP
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetReferenceSource(ADC_Type *ADCx, uint32_t ref)
{
    MODIFY_REG(ADCx->CFGR1, ADC_CFGR1_PEFSEL_Msk, ref);
}

/**
  * @brief    Read ADC Reference Source
  * @rmtoll   CFGR1    PEFSEL    FL_ADC_GetReferenceSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_REF_SOURCE_VDDA
  *           @arg @ref FL_ADC_REF_SOURCE_VREFP
  */
__STATIC_INLINE uint32_t FL_ADC_GetReferenceSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR1, ADC_CFGR1_PEFSEL_Msk));
}

/**
  * @brief    Set ADC OverSampling Multiplier
  * @rmtoll   CFGR2    AVGR    FL_ADC_SetOverSamplingMultiplier
  * @param    ADCx ADC instance
  * @param    mul This parameter can be one of the following values:
  *           @arg @ref FL_ADC_OVERSAMPLING_MUL_2X
  *           @arg @ref FL_ADC_OVERSAMPLING_MUL_4X
  *           @arg @ref FL_ADC_OVERSAMPLING_MUL_8X
  *           @arg @ref FL_ADC_OVERSAMPLING_MUL_16X
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetOverSamplingMultiplier(ADC_Type *ADCx, uint32_t mul)
{
    MODIFY_REG(ADCx->CFGR2, ADC_CFGR2_AVGR_Msk, mul);
}

/**
  * @brief    Read ADC OverSampling Multiplier
  * @rmtoll   CFGR2    AVGR    FL_ADC_GetOverSamplingMultiplier
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_OVERSAMPLING_MUL_2X
  *           @arg @ref FL_ADC_OVERSAMPLING_MUL_4X
  *           @arg @ref FL_ADC_OVERSAMPLING_MUL_8X
  *           @arg @ref FL_ADC_OVERSAMPLING_MUL_16X
  */
__STATIC_INLINE uint32_t FL_ADC_GetOverSamplingMultiplier(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR2, ADC_CFGR2_AVGR_Msk));
}

/**
  * @brief    Set ADC OverSampling Mode
  * @rmtoll   CFGR2    AVGEN    FL_ADC_SetOverSamplingMode
  * @param    ADCx ADC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_ADC_OVERSAMPLING_MODE_DISABLE
  *           @arg @ref FL_ADC_OVERSAMPLING_MODE_ENABLE_AVERAGE
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetOverSamplingMode(ADC_Type *ADCx, uint32_t mode)
{
    MODIFY_REG(ADCx->CFGR2, ADC_CFGR2_AVGEN_Msk, mode);
}

/**
  * @brief    Read ADC OverSampling Mode
  * @rmtoll   CFGR2    AVGEN    FL_ADC_GetOverSamplingMode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_OVERSAMPLING_MODE_DISABLE
  *           @arg @ref FL_ADC_OVERSAMPLING_MODE_ENABLE_AVERAGE
  */
__STATIC_INLINE uint32_t FL_ADC_GetOverSamplingMode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR2, ADC_CFGR2_AVGEN_Msk));
}

/**
  * @brief    Enable ADC Wait Mode
  * @rmtoll   CFGR2    WAIT    FL_ADC_EnableWaitMode
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableWaitMode(ADC_Type *ADCx)
{
    SET_BIT(ADCx->CFGR2, ADC_CFGR2_WAIT_Msk);
}

/**
  * @brief    Disable ADC Wait Mode
  * @rmtoll   CFGR2    WAIT    FL_ADC_DisableWaitMode
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_DisableWaitMode(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->CFGR2, ADC_CFGR2_WAIT_Msk);
}

/**
  * @brief    Get ADC Wait Mode Enable Status
  * @rmtoll   CFGR2    WAIT    FL_ADC_IsEnabledWaitMode
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabledWaitMode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR2, ADC_CFGR2_WAIT_Msk) == ADC_CFGR2_WAIT_Msk);
}

/**
  * @brief    Set ADC Triger Mode
  * @rmtoll   CFGR2    TMOD    FL_ADC_SetTrigerMode
  * @param    ADCx ADC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_ADC_TRIGER_MODE_NOMAL
  *           @arg @ref FL_ADC_TRIGER_MODE_ONE_SHOT
  *           @arg @ref FL_ADC_TRIGER_MODE_CONTINUOUS
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetTrigerMode(ADC_Type *ADCx, uint32_t mode)
{
    MODIFY_REG(ADCx->CFGR2, ADC_CFGR2_TMOD_Msk, mode);
}

/**
  * @brief    Read ADC Triger Mode
  * @rmtoll   CFGR2    TMOD    FL_ADC_GetTrigerMode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_TRIGER_MODE_NOMAL
  *           @arg @ref FL_ADC_TRIGER_MODE_ONE_SHOT
  *           @arg @ref FL_ADC_TRIGER_MODE_CONTINUOUS
  */
__STATIC_INLINE uint32_t FL_ADC_GetTrigerMode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR2, ADC_CFGR2_TMOD_Msk));
}

/**
  * @brief    Enable ADC Overrun Mode
  * @rmtoll   CFGR2    OVRM    FL_ADC_EnableOverrunMode
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableOverrunMode(ADC_Type *ADCx)
{
    SET_BIT(ADCx->CFGR2, ADC_CFGR2_OVRM_Msk);
}

/**
  * @brief    Disable ADC Overrun Mode
  * @rmtoll   CFGR2    OVRM    FL_ADC_DisableOverrunMode
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_DisableOverrunMode(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->CFGR2, ADC_CFGR2_OVRM_Msk);
}

/**
  * @brief    Get ADC Overrun Mode Enable Status
  * @rmtoll   CFGR2    OVRM    FL_ADC_IsEnabledOverrunMode
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabledOverrunMode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR2, ADC_CFGR2_OVRM_Msk) == ADC_CFGR2_OVRM_Msk);
}

/**
  * @brief    Enable ADC DMA
  * @rmtoll   CFGR2    DMAEN    FL_ADC_EnableDMAReq
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableDMAReq(ADC_Type *ADCx)
{
    SET_BIT(ADCx->CFGR2, ADC_CFGR2_DMAEN_Msk);
}

/**
  * @brief    Disable ADC DMA
  * @rmtoll   CFGR2    DMAEN    FL_ADC_DisableDMAReq
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_DisableDMAReq(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->CFGR2, ADC_CFGR2_DMAEN_Msk);
}

/**
  * @brief    Get ADC DMA Enable Status
  * @rmtoll   CFGR2    DMAEN    FL_ADC_IsEnabledDMAReq
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabledDMAReq(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CFGR2, ADC_CFGR2_DMAEN_Msk) == ADC_CFGR2_DMAEN_Msk);
}

/**
  * @brief    Set ADC Injection Control
  * @rmtoll   PRICR    INJC    FL_ADC_SetInjectionControl
  * @param    ADCx ADC instance
  * @param    config This parameter can be one of the following values:
  *           @arg @ref FL_ADC_INJECTION_CONTROL_NONE
  *           @arg @ref FL_ADC_INJECTION_CONTROL_ACQ0
  *           @arg @ref FL_ADC_INJECTION_CONTROL_ACQ0_TO_1
  *           @arg @ref FL_ADC_INJECTION_CONTROL_ACQ0_TO_2
  *           @arg @ref FL_ADC_INJECTION_CONTROL_ACQ0_TO_3
  *           @arg @ref FL_ADC_INJECTION_CONTROL_ACQ0_TO_4
  *           @arg @ref FL_ADC_INJECTION_CONTROL_ACQ0_TO_5
  *           @arg @ref FL_ADC_INJECTION_CONTROL_ACQ0_TO_6
  *           @arg @ref FL_ADC_INJECTION_CONTROL_ACQ0_TO_7
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetInjectionControl(ADC_Type *ADCx, uint32_t config)
{
    MODIFY_REG(ADCx->PRICR, ADC_PRICR_INJC_Msk, config);
}

/**
  * @brief    Set ACQ14 and ACQ15 Mode
  * @rmtoll   DMR    DM14    FL_ADC_SetDual14Mode
  * @param    ADCx ADC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_ADC_DUAL14_MODE_DISABLE
  *           @arg @ref FL_ADC_DUAL14_MODE_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetDual14Mode(ADC_Type *ADCx, uint32_t mode)
{
    MODIFY_REG(ADCx->DMR, ADC_DMR_DM14_Msk, mode);
}

/**
  * @brief    Read ACQ14 and ACQ15 Mode
  * @rmtoll   DMR    DM14    FL_ADC_GetDual14Mode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_DUAL14_MODE_DISABLE
  *           @arg @ref FL_ADC_DUAL14_MODE_ENABLE
  */
__STATIC_INLINE uint32_t FL_ADC_GetDual14Mode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DMR, ADC_DMR_DM14_Msk));
}

/**
  * @brief    Set ACQ12 and ACQ13 Mode
  * @rmtoll   DMR    DM12    FL_ADC_SetDual12Mode
  * @param    ADCx ADC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_ADC_DUAL12_MODE_DISABLE
  *           @arg @ref FL_ADC_DUAL12_MODE_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetDual12Mode(ADC_Type *ADCx, uint32_t mode)
{
    MODIFY_REG(ADCx->DMR, ADC_DMR_DM12_Msk, mode);
}

/**
  * @brief    Read ACQ12 and ACQ13 Mode
  * @rmtoll   DMR    DM12    FL_ADC_GetDual12Mode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_DUAL12_MODE_DISABLE
  *           @arg @ref FL_ADC_DUAL12_MODE_ENABLE
  */
__STATIC_INLINE uint32_t FL_ADC_GetDual12Mode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DMR, ADC_DMR_DM12_Msk));
}

/**
  * @brief    Set ACQ10 and ACQ11 Mode
  * @rmtoll   DMR    DM10    FL_ADC_SetDual10Mode
  * @param    ADCx ADC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_ADC_DUAL10_MODE_DISABLE
  *           @arg @ref FL_ADC_DUAL10_MODE_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetDual10Mode(ADC_Type *ADCx, uint32_t mode)
{
    MODIFY_REG(ADCx->DMR, ADC_DMR_DM10_Msk, mode);
}

/**
  * @brief    Read ACQ10 and ACQ11 Mode
  * @rmtoll   DMR    DM10    FL_ADC_GetDual10Mode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_DUAL10_MODE_DISABLE
  *           @arg @ref FL_ADC_DUAL10_MODE_ENABLE
  */
__STATIC_INLINE uint32_t FL_ADC_GetDual10Mode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DMR, ADC_DMR_DM10_Msk));
}

/**
  * @brief    Set ACQ8 and ACQ9 Mode
  * @rmtoll   DMR    DM8    FL_ADC_SetDual8Mode
  * @param    ADCx ADC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_ADC_DUAL8_MODE_DISABLE
  *           @arg @ref FL_ADC_DUAL8_MODE_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetDual8Mode(ADC_Type *ADCx, uint32_t mode)
{
    MODIFY_REG(ADCx->DMR, ADC_DMR_DM8_Msk, mode);
}

/**
  * @brief    Read ACQ8 and ACQ9 Mode
  * @rmtoll   DMR    DM8    FL_ADC_GetDual8Mode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_DUAL8_MODE_DISABLE
  *           @arg @ref FL_ADC_DUAL8_MODE_ENABLE
  */
__STATIC_INLINE uint32_t FL_ADC_GetDual8Mode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DMR, ADC_DMR_DM8_Msk));
}

/**
  * @brief    Set ACQ6 and ACQ7 Mode
  * @rmtoll   DMR    DM6    FL_ADC_SetDual6Mode
  * @param    ADCx ADC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_ADC_DUAL6_MODE_DISABLE
  *           @arg @ref FL_ADC_DUAL6_MODE_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetDual6Mode(ADC_Type *ADCx, uint32_t mode)
{
    MODIFY_REG(ADCx->DMR, ADC_DMR_DM6_Msk, mode);
}

/**
  * @brief    Read ACQ6 and ACQ7 Mode
  * @rmtoll   DMR    DM6    FL_ADC_GetDual6Mode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_DUAL6_MODE_DISABLE
  *           @arg @ref FL_ADC_DUAL6_MODE_ENABLE
  */
__STATIC_INLINE uint32_t FL_ADC_GetDual6Mode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DMR, ADC_DMR_DM6_Msk));
}

/**
  * @brief    Set ACQ4 and ACQ5 Mode
  * @rmtoll   DMR    DM4    FL_ADC_SetDual4Mode
  * @param    ADCx ADC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_ADC_DUAL4_MODE_DISABLE
  *           @arg @ref FL_ADC_DUAL4_MODE_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetDual4Mode(ADC_Type *ADCx, uint32_t mode)
{
    MODIFY_REG(ADCx->DMR, ADC_DMR_DM4_Msk, mode);
}

/**
  * @brief    Read ACQ4 and ACQ5 Mode
  * @rmtoll   DMR    DM4    FL_ADC_GetDual4Mode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_DUAL4_MODE_DISABLE
  *           @arg @ref FL_ADC_DUAL4_MODE_ENABLE
  */
__STATIC_INLINE uint32_t FL_ADC_GetDual4Mode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DMR, ADC_DMR_DM4_Msk));
}

/**
  * @brief    Set ACQ2 and ACQ3 Mode
  * @rmtoll   DMR    DM2    FL_ADC_SetDual2Mode
  * @param    ADCx ADC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_ADC_DUAL2_MODE_DISABLE
  *           @arg @ref FL_ADC_DUAL2_MODE_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetDual2Mode(ADC_Type *ADCx, uint32_t mode)
{
    MODIFY_REG(ADCx->DMR, ADC_DMR_DM2_Msk, mode);
}

/**
  * @brief    Read ACQ2 and ACQ3 Mode
  * @rmtoll   DMR    DM2    FL_ADC_GetDual2Mode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_DUAL2_MODE_DISABLE
  *           @arg @ref FL_ADC_DUAL2_MODE_ENABLE
  */
__STATIC_INLINE uint32_t FL_ADC_GetDual2Mode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DMR, ADC_DMR_DM2_Msk));
}

/**
  * @brief    Set ACQ0 and ACQ1 Mode
  * @rmtoll   DMR    DM0    FL_ADC_SetDual0Mode
  * @param    ADCx ADC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_ADC_DUAL0_MODE_DISABLE
  *           @arg @ref FL_ADC_DUAL0_MODE_ENABLE
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetDual0Mode(ADC_Type *ADCx, uint32_t mode)
{
    MODIFY_REG(ADCx->DMR, ADC_DMR_DM0_Msk, mode);
}

/**
  * @brief    Read ACQ0 and ACQ1 Mode
  * @rmtoll   DMR    DM0    FL_ADC_GetDual0Mode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_DUAL0_MODE_DISABLE
  *           @arg @ref FL_ADC_DUAL0_MODE_ENABLE
  */
__STATIC_INLINE uint32_t FL_ADC_GetDual0Mode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DMR, ADC_DMR_DM0_Msk));
}

/**
  * @brief    Write P Channel Calibration Value
  * @rmtoll   OSR    POS_CALI    FL_ADC_WritePChannelCalibration
  * @param    ADCx ADC instance
  * @param    calibration
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_WritePChannelCalibration(ADC_Type *ADCx, uint32_t calibration)
{
    MODIFY_REG(ADCx->OSR, (0x1fffU << 16U), (calibration << 16U));
}

/**
  * @brief    Get P Channel Calibration Value
  * @rmtoll   OSR    POS_CALI    FL_ADC_ReadPChannelCalibration
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadPChannelCalibration(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->OSR, (0x1fffU << 16U)) >> 16U);
}

/**
  * @brief    Write N Channel Calibration Value
  * @rmtoll   OSR    NOS_CALI    FL_ADC_WriteNChannelCalibration
  * @param    ADCx ADC instance
  * @param    calibration
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_WriteNChannelCalibration(ADC_Type *ADCx, uint32_t calibration)
{
    MODIFY_REG(ADCx->OSR, (0x1fffU << 0U), (calibration << 0U));
}

/**
  * @brief    Get N Channel Calibration Value
  * @rmtoll   OSR    NOS_CALI    FL_ADC_ReadNChannelCalibration
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadNChannelCalibration(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->OSR, (0x1fffU << 0U)) >> 0U);
}

/**
  * @brief    Read ACQx Pending Flag
  * @rmtoll   ACQ_SR    REQ    FL_ADC_IsActiveFlag_ACQxPending
  * @param    ADCx ADC instance
  * @param    acqx_pending This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsActiveFlag_ACQxPending(ADC_Type *ADCx, uint32_t acqx_pending)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ_SR, ((acqx_pending & 0xffff) << 0x0U)) == ((acqx_pending & 0xffff) << 0x0U));
}

