waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_adc.h
/**
  * @brief    Set ACQ0 Channel
  * @rmtoll   ACQ0_CR    CHSEL    FL_ADC_SetACQ0ChannelSelect
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_N_CALIBRATION
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ0ChannelSelect(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->ACQ0_CR, ADC_ACQ0_CR_CHSEL_Msk, channel);
}

/**
  * @brief    Read ACQ0 Channel
  * @rmtoll   ACQ0_CR    CHSEL    FL_ADC_GetACQ0ChannelSelect
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INA8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ0_SELECT_CHANNEL_N_CALIBRATION
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ0ChannelSelect(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ0_CR, ADC_ACQ0_CR_CHSEL_Msk));
}

/**
  * @brief    Set ACQ0 Trigger Source
  * @rmtoll   ACQ0_CR    TRIGSEL    FL_ADC_SetACQ0TriggerSource
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ0_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ0_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ0_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ0_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ0_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ0_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ0_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ0_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ0_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ0_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ0_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ0_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ0_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ0_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ0_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_BSTIM0_TRGO
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ0TriggerSource(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->ACQ0_CR, ADC_ACQ0_CR_TRIGSEL_Msk, source);
}

/**
  * @brief    Get ACQ0 Trigger Source
  * @rmtoll   ACQ0_CR    TRIGSEL    FL_ADC_GetACQ0TriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ0_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ0_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ0_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ0_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ0_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ0_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ0_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ0_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ0_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ0_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ0_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ0_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ0_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ0_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ0_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ0_TRGI_BSTIM0_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ0TriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ0_CR, ADC_ACQ0_CR_TRIGSEL_Msk));
}

/**
  * @brief    Set ACQ0 Sampling Time
  * @rmtoll   ACQ0_CR    SMTS    FL_ADC_SetACQ0SamplingTime
  * @param    ADCx ADC instance
  * @param    time This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ0SamplingTime(ADC_Type *ADCx, uint32_t time)
{
    MODIFY_REG(ADCx->ACQ0_CR, ADC_ACQ0_CR_SMTS_Msk, time);
}

/**
  * @brief    Read ACQ0 Sampling Time
  * @rmtoll   ACQ0_CR    SMTS    FL_ADC_GeACQ0SamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ0_SAMPLING_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GeACQ0SamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ0_CR, ADC_ACQ0_CR_SMTS_Msk));
}

/**
  * @brief    Set ACQ1 Channel
  * @rmtoll   ACQ1_CR    CHSEL    FL_ADC_SetACQ1ChannelSelect
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_N_CALIBRATION
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ1ChannelSelect(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->ACQ1_CR, ADC_ACQ1_CR_CHSEL_Msk, channel);
}

/**
  * @brief    Read ACQ1 Channel
  * @rmtoll   ACQ1_CR    CHSEL    FL_ADC_GetACQ1ChannelSelect
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ1_SELECT_CHANNEL_N_CALIBRATION
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ1ChannelSelect(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ1_CR, ADC_ACQ1_CR_CHSEL_Msk));
}

/**
  * @brief    Set ACQ1 Trigger Source
  * @rmtoll   ACQ1_CR    TRIGSEL    FL_ADC_SetACQ1TriggerSource
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ1_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ1_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ1_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ1_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ1_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ1_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ1_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ1_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ1_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ1_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ1_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ1_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ1_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ1_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ1_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ1_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_BSTIM0_TRGO
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ1TriggerSource(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->ACQ1_CR, ADC_ACQ1_CR_TRIGSEL_Msk, source);
}

/**
  * @brief    Get ACQ1 Trigger Source
  * @rmtoll   ACQ1_CR    TRIGSEL    FL_ADC_GetACQ1TriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ1_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ1_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ1_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ1_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ1_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ1_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ1_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ1_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ1_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ1_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ1_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ1_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ1_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ1_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ1_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ1_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ1_TRGI_BSTIM0_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ1TriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ1_CR, ADC_ACQ1_CR_TRIGSEL_Msk));
}

/**
  * @brief    Set ACQ1 Sampling Time
  * @rmtoll   ACQ1_CR    SMTS    FL_ADC_SetACQ1SamplingTime
  * @param    ADCx ADC instance
  * @param    time This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ1SamplingTime(ADC_Type *ADCx, uint32_t time)
{
    MODIFY_REG(ADCx->ACQ1_CR, ADC_ACQ1_CR_SMTS_Msk, time);
}

/**
  * @brief    Read ACQ1 Sampling Time
  * @rmtoll   ACQ1_CR    SMTS    FL_ADC_GeACQ1SamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ1_SAMPLING_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GeACQ1SamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ1_CR, ADC_ACQ1_CR_SMTS_Msk));
}

/**
  * @brief    Set ACQ2 Channel
  * @rmtoll   ACQ2_CR    CHSEL    FL_ADC_SetACQ2ChannelSelect
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_N_CALIBRATION
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ2ChannelSelect(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->ACQ2_CR, ADC_ACQ2_CR_CHSEL_Msk, channel);
}

/**
  * @brief    Read ACQ2 Channel
  * @rmtoll   ACQ2_CR    CHSEL    FL_ADC_GetACQ2ChannelSelect
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ2_SELECT_CHANNEL_N_CALIBRATION
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ2ChannelSelect(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ2_CR, ADC_ACQ2_CR_CHSEL_Msk));
}

