waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_adc.h
/**
  * @brief    Set ACQ2 Trigger Source
  * @rmtoll   ACQ2_CR    TRIGSEL    FL_ADC_SetACQ2TriggerSource
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ2_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ2_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ2_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ2_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ2_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ2_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ2_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ2_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ2_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ2_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ2_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ2_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ2_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ2_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ2_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ2_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_BSTIM0_TRGO
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ2TriggerSource(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->ACQ2_CR, ADC_ACQ2_CR_TRIGSEL_Msk, source);
}

/**
  * @brief    Get ACQ2 Trigger Source
  * @rmtoll   ACQ2_CR    TRIGSEL    FL_ADC_GetACQ2TriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ2_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ2_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ2_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ2_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ2_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ2_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ2_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ2_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ2_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ2_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ2_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ2_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ2_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ2_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ2_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ2_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ2_TRGI_BSTIM0_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ2TriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ2_CR, ADC_ACQ2_CR_TRIGSEL_Msk));
}

/**
  * @brief    Set ACQ2 Sampling Time
  * @rmtoll   ACQ2_CR    SMTS    FL_ADC_SetACQ2SamplingTime
  * @param    ADCx ADC instance
  * @param    time This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ2SamplingTime(ADC_Type *ADCx, uint32_t time)
{
    MODIFY_REG(ADCx->ACQ2_CR, ADC_ACQ2_CR_SMTS_Msk, time);
}

/**
  * @brief    Read ACQ2 Sampling Time
  * @rmtoll   ACQ2_CR    SMTS    FL_ADC_GeACQ2SamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ2_SAMPLING_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GeACQ2SamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ2_CR, ADC_ACQ2_CR_SMTS_Msk));
}

/**
  * @brief    Set ACQ3 Channel
  * @rmtoll   ACQ3_CR    CHSEL    FL_ADC_SetACQ3ChannelSelect
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_N_CALIBRATION
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ3ChannelSelect(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->ACQ3_CR, ADC_ACQ3_CR_CHSEL_Msk, channel);
}

/**
  * @brief    Read ACQ3 Channel
  * @rmtoll   ACQ3_CR    CHSEL    FL_ADC_GetACQ3ChannelSelect
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ3_SELECT_CHANNEL_N_CALIBRATION
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ3ChannelSelect(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ3_CR, ADC_ACQ3_CR_CHSEL_Msk));
}

/**
  * @brief    Set ACQ3 Trigger Source
  * @rmtoll   ACQ3_CR    TRIGSEL    FL_ADC_SetACQ3TriggerSource
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ3_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ3_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ3_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ3_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ3_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ3_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ3_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ3_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ3_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ3_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ3_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ3_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ3_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ3_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ3_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ3_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_BSTIM0_TRGO
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ3TriggerSource(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->ACQ3_CR, ADC_ACQ3_CR_TRIGSEL_Msk, source);
}

/**
  * @brief    Get ACQ3 Trigger Source
  * @rmtoll   ACQ3_CR    TRIGSEL    FL_ADC_GetACQ3TriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ3_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ3_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ3_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ3_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ3_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ3_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ3_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ3_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ3_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ3_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ3_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ3_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ3_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ3_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ3_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ3_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ3_TRGI_BSTIM0_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ3TriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ3_CR, ADC_ACQ3_CR_TRIGSEL_Msk));
}

/**
  * @brief    Set ACQ3 Sampling Time
  * @rmtoll   ACQ3_CR    SMTS    FL_ADC_SetACQ3SamplingTime
  * @param    ADCx ADC instance
  * @param    time This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ3SamplingTime(ADC_Type *ADCx, uint32_t time)
{
    MODIFY_REG(ADCx->ACQ3_CR, ADC_ACQ3_CR_SMTS_Msk, time);
}

/**
  * @brief    Read ACQ3 Sampling Time
  * @rmtoll   ACQ3_CR    SMTS    FL_ADC_GeACQ3SamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ3_SAMPLING_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GeACQ3SamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ3_CR, ADC_ACQ3_CR_SMTS_Msk));
}

/**
  * @brief    Set ACQ4 Channel
  * @rmtoll   ACQ4_CR    CHSEL    FL_ADC_SetACQ4ChannelSelect
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_N_CALIBRATION
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ4ChannelSelect(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->ACQ4_CR, ADC_ACQ4_CR_CHSEL_Msk, channel);
}

/**
  * @brief    Read ACQ4 Channel
  * @rmtoll   ACQ4_CR    CHSEL    FL_ADC_GetACQ4ChannelSelect
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ4_SELECT_CHANNEL_N_CALIBRATION
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ4ChannelSelect(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ4_CR, ADC_ACQ4_CR_CHSEL_Msk));
}

/**
  * @brief    Set ACQ4 Trigger Source
  * @rmtoll   ACQ4_CR    TRIGSEL    FL_ADC_SetACQ4TriggerSource
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ4_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ4_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ4_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ4_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ4_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ4_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ4_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ4_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ4_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ4_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ4_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ4_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ4_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ4_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ4_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ4_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_BSTIM0_TRGO
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ4TriggerSource(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->ACQ4_CR, ADC_ACQ4_CR_TRIGSEL_Msk, source);
}

/**
  * @brief    Get ACQ4 Trigger Source
  * @rmtoll   ACQ4_CR    TRIGSEL    FL_ADC_GetACQ4TriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ4_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ4_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ4_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ4_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ4_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ4_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ4_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ4_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ4_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ4_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ4_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ4_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ4_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ4_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ4_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ4_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ4_TRGI_BSTIM0_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ4TriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ4_CR, ADC_ACQ4_CR_TRIGSEL_Msk));
}

/**
  * @brief    Set ACQ4 Sampling Time
  * @rmtoll   ACQ4_CR    SMTS    FL_ADC_SetACQ4SamplingTime
  * @param    ADCx ADC instance
  * @param    time This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ4_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ4_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ4_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ4_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ4_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ4_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ4_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ4_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ4_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ4_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ4_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ4_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ4_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ4_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ4_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ4_SAMPLING_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ4SamplingTime(ADC_Type *ADCx, uint32_t time)
{
    MODIFY_REG(ADCx->ACQ4_CR, ADC_ACQ4_CR_SMTS_Msk, time);
}

