waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_adc.h
/**
  * @brief    Read ACQ7 Channel
  * @rmtoll   ACQ7_CR    CHSEL    FL_ADC_GetACQ7ChannelSelect
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ7_SELECT_CHANNEL_N_CALIBRATION
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ7ChannelSelect(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ7_CR, ADC_ACQ7_CR_CHSEL_Msk));
}

/**
  * @brief    Set ACQ7 Trigger Source
  * @rmtoll   ACQ7_CR    TRIGSEL    FL_ADC_SetACQ7TriggerSource
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ7_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ7_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ7_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ7_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ7_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ7_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ7_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ7_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ7_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ7_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ7_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ7_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ7_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ7_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ7_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ7_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_BSTIM0_TRGO
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ7TriggerSource(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->ACQ7_CR, ADC_ACQ7_CR_TRIGSEL_Msk, source);
}

/**
  * @brief    Get ACQ7 Trigger Source
  * @rmtoll   ACQ7_CR    TRIGSEL    FL_ADC_GetACQ7TriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ7_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ7_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ7_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ7_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ7_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ7_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ7_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ7_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ7_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ7_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ7_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ7_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ7_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ7_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ7_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ7_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ7_TRGI_BSTIM0_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ7TriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ7_CR, ADC_ACQ7_CR_TRIGSEL_Msk));
}

/**
  * @brief    Set ACQ7 Sampling Time
  * @rmtoll   ACQ7_CR    SMTS    FL_ADC_SetACQ7SamplingTime
  * @param    ADCx ADC instance
  * @param    time This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ7SamplingTime(ADC_Type *ADCx, uint32_t time)
{
    MODIFY_REG(ADCx->ACQ7_CR, ADC_ACQ7_CR_SMTS_Msk, time);
}

/**
  * @brief    Read ACQ7 Sampling Time
  * @rmtoll   ACQ7_CR    SMTS    FL_ADC_GeACQ7SamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ7_SAMPLING_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GeACQ7SamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ7_CR, ADC_ACQ7_CR_SMTS_Msk));
}

/**
  * @brief    Set ACQ8 Channel
  * @rmtoll   ACQ8_CR    CHSEL    FL_ADC_SetACQ8ChannelSelect
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_N_CALIBRATION
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ8ChannelSelect(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->ACQ8_CR, ADC_ACQ8_CR_CHSEL_Msk, channel);
}

/**
  * @brief    Read ACQ8 Channel
  * @rmtoll   ACQ8_CR    CHSEL    FL_ADC_GetACQ8ChannelSelect
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ8_SELECT_CHANNEL_N_CALIBRATION
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ8ChannelSelect(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ8_CR, ADC_ACQ8_CR_CHSEL_Msk));
}

/**
  * @brief    Set ACQ8 Trigger Source
  * @rmtoll   ACQ8_CR    TRIGSEL    FL_ADC_SetACQ8TriggerSource
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ8_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ8_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ8_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ8_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ8_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ8_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ8_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ8_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ8_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ8_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ8_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ8_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ8_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ8_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ8_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ8_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_BSTIM0_TRGO
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ8TriggerSource(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->ACQ8_CR, ADC_ACQ8_CR_TRIGSEL_Msk, source);
}

/**
  * @brief    Get ACQ8 Trigger Source
  * @rmtoll   ACQ8_CR    TRIGSEL    FL_ADC_GetACQ8TriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ8_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ8_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ8_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ8_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ8_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ8_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ8_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ8_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ8_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ8_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ8_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ8_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ8_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ8_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ8_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ8_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ8_TRGI_BSTIM0_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ8TriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ8_CR, ADC_ACQ8_CR_TRIGSEL_Msk));
}

/**
  * @brief    Set ACQ8 Sampling Time
  * @rmtoll   ACQ8_CR    SMTS    FL_ADC_SetACQ8SamplingTime
  * @param    ADCx ADC instance
  * @param    time This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ8SamplingTime(ADC_Type *ADCx, uint32_t time)
{
    MODIFY_REG(ADCx->ACQ8_CR, ADC_ACQ8_CR_SMTS_Msk, time);
}

/**
  * @brief    Read ACQ8 Sampling Time
  * @rmtoll   ACQ8_CR    SMTS    FL_ADC_GeACQ8SamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ8_SAMPLING_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GeACQ8SamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ8_CR, ADC_ACQ8_CR_SMTS_Msk));
}

/**
  * @brief    Set ACQ9 Channel
  * @rmtoll   ACQ9_CR    CHSEL    FL_ADC_SetACQ9ChannelSelect
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_N_CALIBRATION
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ9ChannelSelect(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->ACQ9_CR, ADC_ACQ9_CR_CHSEL_Msk, channel);
}

/**
  * @brief    Read ACQ9 Channel
  * @rmtoll   ACQ9_CR    CHSEL    FL_ADC_GetACQ9ChannelSelect
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ9_SELECT_CHANNEL_N_CALIBRATION
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ9ChannelSelect(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ9_CR, ADC_ACQ9_CR_CHSEL_Msk));
}

/**
  * @brief    Set ACQ9 Trigger Source
  * @rmtoll   ACQ9_CR    TRIGSEL    FL_ADC_SetACQ9TriggerSource
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ9_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ9_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ9_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ9_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ9_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ9_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ9_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ9_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ9_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ9_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ9_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ9_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ9_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ9_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ9_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ9_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_BSTIM0_TRGO
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ9TriggerSource(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->ACQ9_CR, ADC_ACQ9_CR_TRIGSEL_Msk, source);
}

