waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_adc.h
/**
  * @brief    Get ACQ9 Trigger Source
  * @rmtoll   ACQ9_CR    TRIGSEL    FL_ADC_GetACQ9TriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ9_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ9_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ9_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ9_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ9_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ9_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ9_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ9_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ9_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ9_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ9_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ9_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ9_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ9_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ9_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ9_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ9_TRGI_BSTIM0_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ9TriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ9_CR, ADC_ACQ9_CR_TRIGSEL_Msk));
}

/**
  * @brief    Set ACQ9 Sampling Time
  * @rmtoll   ACQ9_CR    SMTS    FL_ADC_SetACQ9SamplingTime
  * @param    ADCx ADC instance
  * @param    time This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ9SamplingTime(ADC_Type *ADCx, uint32_t time)
{
    MODIFY_REG(ADCx->ACQ9_CR, ADC_ACQ9_CR_SMTS_Msk, time);
}

/**
  * @brief    Read ACQ9 Sampling Time
  * @rmtoll   ACQ9_CR    SMTS    FL_ADC_GeACQ9SamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ9_SAMPLING_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GeACQ9SamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ9_CR, ADC_ACQ9_CR_SMTS_Msk));
}

/**
  * @brief    Set ACQ10 Channel
  * @rmtoll   ACQ10_CR    CHSEL    FL_ADC_SetACQ10ChannelSelect
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_N_CALIBRATION
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ10ChannelSelect(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->ACQ10_CR, ADC_ACQ10_CR_CHSEL_Msk, channel);
}

/**
  * @brief    Read ACQ10 Channel
  * @rmtoll   ACQ10_CR    CHSEL    FL_ADC_GetACQ10ChannelSelect
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ10_SELECT_CHANNEL_N_CALIBRATION
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ10ChannelSelect(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ10_CR, ADC_ACQ10_CR_CHSEL_Msk));
}

/**
  * @brief    Set ACQ10 Trigger Source
  * @rmtoll   ACQ10_CR    TRIGSEL    FL_ADC_SetACQ10TriggerSource
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ10_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ10_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ10_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ10_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ10_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ10_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ10_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ10_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ10_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ10_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ10_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ10_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ10_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ10_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ10_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ10_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_BSTIM0_TRGO
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ10TriggerSource(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->ACQ10_CR, ADC_ACQ10_CR_TRIGSEL_Msk, source);
}

/**
  * @brief    Get ACQ10 Trigger Source
  * @rmtoll   ACQ10_CR    TRIGSEL    FL_ADC_GetACQ10TriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ10_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ10_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ10_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ10_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ10_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ10_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ10_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ10_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ10_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ10_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ10_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ10_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ10_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ10_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ10_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ10_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ10_TRGI_BSTIM0_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ10TriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ10_CR, ADC_ACQ10_CR_TRIGSEL_Msk));
}

/**
  * @brief    Set ACQ10 Sampling Time
  * @rmtoll   ACQ10_CR    SMTS    FL_ADC_SetACQ10SamplingTime
  * @param    ADCx ADC instance
  * @param    time This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ10SamplingTime(ADC_Type *ADCx, uint32_t time)
{
    MODIFY_REG(ADCx->ACQ10_CR, ADC_ACQ10_CR_SMTS_Msk, time);
}

/**
  * @brief    Read ACQ10 Sampling Time
  * @rmtoll   ACQ10_CR    SMTS    FL_ADC_GeACQ10SamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ10_SAMPLING_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GeACQ10SamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ10_CR, ADC_ACQ10_CR_SMTS_Msk));
}

/**
  * @brief    Set ACQ11 Channel
  * @rmtoll   ACQ11_CR    CHSEL    FL_ADC_SetACQ11ChannelSelect
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_N_CALIBRATION
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ11ChannelSelect(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->ACQ11_CR, ADC_ACQ11_CR_CHSEL_Msk, channel);
}

/**
  * @brief    Read ACQ11 Channel
  * @rmtoll   ACQ11_CR    CHSEL    FL_ADC_GetACQ11ChannelSelect
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ11_SELECT_CHANNEL_N_CALIBRATION
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ11ChannelSelect(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ11_CR, ADC_ACQ11_CR_CHSEL_Msk));
}

/**
  * @brief    Set ACQ11 Trigger Source
  * @rmtoll   ACQ11_CR    TRIGSEL    FL_ADC_SetACQ11TriggerSource
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ11_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ11_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ11_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ11_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ11_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ11_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ11_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ11_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ11_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ11_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ11_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ11_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ11_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ11_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ11_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ11_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_BSTIM0_TRGO
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ11TriggerSource(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->ACQ11_CR, ADC_ACQ11_CR_TRIGSEL_Msk, source);
}

/**
  * @brief    Get ACQ11 Trigger Source
  * @rmtoll   ACQ11_CR    TRIGSEL    FL_ADC_GetACQ11TriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ11_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ11_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ11_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ11_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ11_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ11_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ11_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ11_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ11_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ11_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ11_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ11_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ11_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ11_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ11_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ11_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ11_TRGI_BSTIM0_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ11TriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ11_CR, ADC_ACQ11_CR_TRIGSEL_Msk));
}

/**
  * @brief    Set ACQ11 Sampling Time
  * @rmtoll   ACQ11_CR    SMTS    FL_ADC_SetACQ11SamplingTime
  * @param    ADCx ADC instance
  * @param    time This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ11SamplingTime(ADC_Type *ADCx, uint32_t time)
{
    MODIFY_REG(ADCx->ACQ11_CR, ADC_ACQ11_CR_SMTS_Msk, time);
}

/**
  * @brief    Read ACQ11 Sampling Time
  * @rmtoll   ACQ11_CR    SMTS    FL_ADC_GeACQ11SamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ11_SAMPLING_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GeACQ11SamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ11_CR, ADC_ACQ11_CR_SMTS_Msk));
}

