waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_adc.h
/**
  * @brief    Set ACQ12 Channel
  * @rmtoll   ACQ12_CR    CHSEL    FL_ADC_SetACQ12ChannelSelect
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_N_CALIBRATION
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ12ChannelSelect(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->ACQ12_CR, ADC_ACQ12_CR_CHSEL_Msk, channel);
}

/**
  * @brief    Read ACQ12 Channel
  * @rmtoll   ACQ12_CR    CHSEL    FL_ADC_GetACQ12ChannelSelect
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ12_SELECT_CHANNEL_N_CALIBRATION
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ12ChannelSelect(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ12_CR, ADC_ACQ12_CR_CHSEL_Msk));
}

/**
  * @brief    Set ACQ12 Trigger Source
  * @rmtoll   ACQ12_CR    TRIGSEL    FL_ADC_SetACQ12TriggerSource
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ12_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ12_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ12_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ12_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ12_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ12_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ12_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ12_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ12_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ12_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ12_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ12_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ12_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ12_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ12_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ12_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_BSTIM0_TRGO
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ12TriggerSource(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->ACQ12_CR, ADC_ACQ12_CR_TRIGSEL_Msk, source);
}

/**
  * @brief    Get ACQ12 Trigger Source
  * @rmtoll   ACQ12_CR    TRIGSEL    FL_ADC_GetACQ12TriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ12_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ12_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ12_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ12_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ12_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ12_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ12_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ12_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ12_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ12_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ12_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ12_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ12_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ12_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ12_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ12_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ12_TRGI_BSTIM0_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ12TriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ12_CR, ADC_ACQ12_CR_TRIGSEL_Msk));
}

/**
  * @brief    Set ACQ12 Sampling Time
  * @rmtoll   ACQ12_CR    SMTS    FL_ADC_SetACQ12SamplingTime
  * @param    ADCx ADC instance
  * @param    time This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ12SamplingTime(ADC_Type *ADCx, uint32_t time)
{
    MODIFY_REG(ADCx->ACQ12_CR, ADC_ACQ12_CR_SMTS_Msk, time);
}

/**
  * @brief    Read ACQ12 Sampling Time
  * @rmtoll   ACQ12_CR    SMTS    FL_ADC_GeACQ12SamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ12_SAMPLING_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GeACQ12SamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ12_CR, ADC_ACQ12_CR_SMTS_Msk));
}

/**
  * @brief    Set ACQ13 Channel
  * @rmtoll   ACQ13_CR    CHSEL    FL_ADC_SetACQ13ChannelSelect
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_N_CALIBRATION
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ13ChannelSelect(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->ACQ13_CR, ADC_ACQ13_CR_CHSEL_Msk, channel);
}

/**
  * @brief    Read ACQ13 Channel
  * @rmtoll   ACQ13_CR    CHSEL    FL_ADC_GetACQ13ChannelSelect
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ13_SELECT_CHANNEL_N_CALIBRATION
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ13ChannelSelect(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ13_CR, ADC_ACQ13_CR_CHSEL_Msk));
}

/**
  * @brief    Set ACQ13 Trigger Source
  * @rmtoll   ACQ13_CR    TRIGSEL    FL_ADC_SetACQ13TriggerSource
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ13_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ13_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ13_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ13_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ13_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ13_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ13_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ13_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ13_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ13_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ13_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ13_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ13_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ13_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ13_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ13_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_BSTIM0_TRGO
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ13TriggerSource(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->ACQ13_CR, ADC_ACQ13_CR_TRIGSEL_Msk, source);
}

/**
  * @brief    Get ACQ13 Trigger Source
  * @rmtoll   ACQ13_CR    TRIGSEL    FL_ADC_GetACQ13TriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ13_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ13_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ13_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ13_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ13_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ13_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ13_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ13_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ13_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ13_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ13_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ13_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ13_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ13_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ13_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ13_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ13_TRGI_BSTIM0_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ13TriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ13_CR, ADC_ACQ13_CR_TRIGSEL_Msk));
}

/**
  * @brief    Set ACQ13 Sampling Time
  * @rmtoll   ACQ13_CR    SMTS    FL_ADC_SetACQ13SamplingTime
  * @param    ADCx ADC instance
  * @param    time This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ13SamplingTime(ADC_Type *ADCx, uint32_t time)
{
    MODIFY_REG(ADCx->ACQ13_CR, ADC_ACQ13_CR_SMTS_Msk, time);
}

/**
  * @brief    Read ACQ13 Sampling Time
  * @rmtoll   ACQ13_CR    SMTS    FL_ADC_GeACQ13SamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ13_SAMPLING_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GeACQ13SamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ13_CR, ADC_ACQ13_CR_SMTS_Msk));
}

/**
  * @brief    Set ACQ14 Channel
  * @rmtoll   ACQ14_CR    CHSEL    FL_ADC_SetACQ14ChannelSelect
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_N_CALIBRATION
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ14ChannelSelect(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->ACQ14_CR, ADC_ACQ14_CR_CHSEL_Msk, channel);
}

/**
  * @brief    Read ACQ14 Channel
  * @rmtoll   ACQ14_CR    CHSEL    FL_ADC_GetACQ14ChannelSelect
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ14_SELECT_CHANNEL_N_CALIBRATION
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ14ChannelSelect(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ14_CR, ADC_ACQ14_CR_CHSEL_Msk));
}

