waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_adc.h
/**
  * @brief    Set ACQ14 Trigger Source
  * @rmtoll   ACQ14_CR    TRIGSEL    FL_ADC_SetACQ14TriggerSource
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ14_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ14_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ14_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ14_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ14_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ14_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ14_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ14_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ14_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ14_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ14_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ14_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ14_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ14_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ14_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ14_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_BSTIM0_TRGO
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ14TriggerSource(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->ACQ14_CR, ADC_ACQ14_CR_TRIGSEL_Msk, source);
}

/**
  * @brief    Get ACQ14 Trigger Source
  * @rmtoll   ACQ14_CR    TRIGSEL    FL_ADC_GetACQ14TriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ14_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ14_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ14_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ14_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ14_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ14_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ14_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ14_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ14_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ14_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ14_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ14_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ14_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ14_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ14_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ14_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ14_TRGI_BSTIM0_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ14TriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ14_CR, ADC_ACQ14_CR_TRIGSEL_Msk));
}

/**
  * @brief    Set ACQ14 Sampling Time
  * @rmtoll   ACQ14_CR    SMTS    FL_ADC_SetACQ14SamplingTime
  * @param    ADCx ADC instance
  * @param    time This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ14SamplingTime(ADC_Type *ADCx, uint32_t time)
{
    MODIFY_REG(ADCx->ACQ14_CR, ADC_ACQ14_CR_SMTS_Msk, time);
}

/**
  * @brief    Read ACQ14 Sampling Time
  * @rmtoll   ACQ14_CR    SMTS    FL_ADC_GeACQ14SamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ14_SAMPLING_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GeACQ14SamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ14_CR, ADC_ACQ14_CR_SMTS_Msk));
}

/**
  * @brief    Set ACQ15 Channel
  * @rmtoll   ACQ15_CR    CHSEL    FL_ADC_SetACQ15ChannelSelect
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_N_CALIBRATION
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ15ChannelSelect(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->ACQ15_CR, ADC_ACQ15_CR_CHSEL_Msk, channel);
}

/**
  * @brief    Read ACQ15 Channel
  * @rmtoll   ACQ15_CR    CHSEL    FL_ADC_GetACQ15ChannelSelect
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA0
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA1
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA2
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA3
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA4
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA5
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA6
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INA7
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB8_OPA0_OUT
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_TS
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_AVREF
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_P_CALIBRATION
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB0
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB1
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB2
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB3
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB4
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB5
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB6
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB7
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_ADC_INB8_OPA1_OUT
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_VBAT_DIV3
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_DAC1_OUT1
  *           @arg @ref FL_ADC_ACQ15_SELECT_CHANNEL_N_CALIBRATION
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ15ChannelSelect(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ15_CR, ADC_ACQ15_CR_CHSEL_Msk));
}

/**
  * @brief    Set ACQ15 Trigger Source
  * @rmtoll   ACQ15_CR    TRIGSEL    FL_ADC_SetACQ15TriggerSource
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ15_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ15_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ15_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ15_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ15_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ15_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ15_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ15_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ15_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ15_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ15_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ15_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ15_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ15_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ15_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ15_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_BSTIM0_TRGO
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ15TriggerSource(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->ACQ15_CR, ADC_ACQ15_CR_TRIGSEL_Msk, source);
}

/**
  * @brief    Get ACQ15 Trigger Source
  * @rmtoll   ACQ15_CR    TRIGSEL    FL_ADC_GetACQ15TriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ15_TRGI_SOFE_TRG
  *           @arg @ref FL_ADC_ACQ15_TRGI_LUT0_TRG
  *           @arg @ref FL_ADC_ACQ15_TRGI_LUT1_TRG
  *           @arg @ref FL_ADC_ACQ15_TRGI_LUT2_TRG
  *           @arg @ref FL_ADC_ACQ15_TRGI_LUT3_TRG
  *           @arg @ref FL_ADC_ACQ15_TRGI_ATIM0_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_ATIM1_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_ATIM0_TRGO2
  *           @arg @ref FL_ADC_ACQ15_TRGI_ATIM1_TRGO2
  *           @arg @ref FL_ADC_ACQ15_TRGI_GPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_GPTIM1_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_GPTIM2_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_EPWM0SOCA
  *           @arg @ref FL_ADC_ACQ15_TRGI_EPWM0SOCB
  *           @arg @ref FL_ADC_ACQ15_TRGI_EPWM1SOCA
  *           @arg @ref FL_ADC_ACQ15_TRGI_EPWM1SOCB
  *           @arg @ref FL_ADC_ACQ15_TRGI_EPWM2SOCA
  *           @arg @ref FL_ADC_ACQ15_TRGI_EPWM2SOCB
  *           @arg @ref FL_ADC_ACQ15_TRGI_EPWM3SOCA
  *           @arg @ref FL_ADC_ACQ15_TRGI_EPWM3SOCB
  *           @arg @ref FL_ADC_ACQ15_TRGI_COMP0_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_LPTIM0_TRGO
  *           @arg @ref FL_ADC_ACQ15_TRGI_BSTIM0_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ15TriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ15_CR, ADC_ACQ15_CR_TRIGSEL_Msk));
}

/**
  * @brief    Set ACQ15 Sampling Time
  * @rmtoll   ACQ15_CR    SMTS    FL_ADC_SetACQ15SamplingTime
  * @param    ADCx ADC instance
  * @param    time This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ15SamplingTime(ADC_Type *ADCx, uint32_t time)
{
    MODIFY_REG(ADCx->ACQ15_CR, ADC_ACQ15_CR_SMTS_Msk, time);
}

/**
  * @brief    Read ACQ15 Sampling Time
  * @rmtoll   ACQ15_CR    SMTS    FL_ADC_GeACQ15SamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ15_SAMPLING_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GeACQ15SamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ15_CR, ADC_ACQ15_CR_SMTS_Msk));
}

/**
  * @brief    Get ACQ0 Conversion Data
  * @rmtoll   ACQ0_DR    RESULT    FL_ADC_ReadACQ0ConversionData
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ0ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ0_DR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get ACQ1 Conversion Data
  * @rmtoll   ACQ1_DR    RESULT    FL_ADC_ReadACQ1ConversionData
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ1ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ1_DR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get ACQ2 Conversion Data
  * @rmtoll   ACQ2_DR    RESULT    FL_ADC_ReadACQ2ConversionData
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ2ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ2_DR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get ACQ3 Conversion Data
  * @rmtoll   ACQ3_DR    RESULT    FL_ADC_ReadACQ3ConversionData
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ3ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ3_DR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get ACQ4 Conversion Data
  * @rmtoll   ACQ4_DR    RESULT    FL_ADC_ReadACQ4ConversionData
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ4ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ4_DR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get ACQ5 Conversion Data
  * @rmtoll   ACQ5_DR    RESULT    FL_ADC_ReadACQ5ConversionData
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ5ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ5_DR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get ACQ6 Conversion Data
  * @rmtoll   ACQ6_DR    RESULT    FL_ADC_ReadACQ6ConversionData
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ6ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ6_DR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get ACQ7 Conversion Data
  * @rmtoll   ACQ7_DR    RESULT    FL_ADC_ReadACQ7ConversionData
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ7ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ7_DR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get ACQ8 Conversion Data
  * @rmtoll   ACQ8_DR    RESULT    FL_ADC_ReadACQ8ConversionData
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ8ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ8_DR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get ACQ9 Conversion Data
  * @rmtoll   ACQ9_DR    RESULT    FL_ADC_ReadACQ9ConversionData
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ9ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ9_DR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get ACQ10 Conversion Data
  * @rmtoll   ACQ10_DR    RESULT    FL_ADC_ReadACQ10ConversionData
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ10ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ10_DR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get ACQ11 Conversion Data
  * @rmtoll   ACQ11_DR    RESULT    FL_ADC_ReadACQ11ConversionData
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ11ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ11_DR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get ACQ12 Conversion Data
  * @rmtoll   ACQ12_DR    RESULT    FL_ADC_ReadACQ12ConversionData
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ12ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ12_DR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get ACQ13 Conversion Data
  * @rmtoll   ACQ13_DR    RESULT    FL_ADC_ReadACQ13ConversionData
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ13ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ13_DR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get ACQ14 Conversion Data
  * @rmtoll   ACQ14_DR    RESULT    FL_ADC_ReadACQ14ConversionData
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ14ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ14_DR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get ACQ15 Conversion Data
  * @rmtoll   ACQ15_DR    RESULT    FL_ADC_ReadACQ15ConversionData
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadACQ15ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ15_DR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Enable ACQx DMA Combination
  * @rmtoll   DMACOMB_CR    COMB_ACQEN    FL_ADC_EnableACQ_DMACombination
  * @param    ADCx ADC instance
  * @param    acqx_comb This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableACQ_DMACombination(ADC_Type *ADCx, uint32_t acqx_comb)
{
    SET_BIT(ADCx->DMACOMB_CR, ((acqx_comb & 0xffff) << 0x0U));
}

/**
  * @brief    Disable ACQx DMA Combination
  * @rmtoll   DMACOMB_CR    COMB_ACQEN    FL_ADC_DisableACQ_DMACombination
  * @param    ADCx ADC instance
  * @param    acqx_comb This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_DisableACQ_DMACombination(ADC_Type *ADCx, uint32_t acqx_comb)
{
    CLEAR_BIT(ADCx->DMACOMB_CR, ((acqx_comb & 0xffff) << 0x0U));
}

/**
  * @brief    Get ACQx DMA Combination
  * @rmtoll   DMACOMB_CR    COMB_ACQEN    FL_ADC_IsEnabledACQ_DMACombination
  * @param    ADCx ADC instance
  * @param    acqx_comb This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ0
  *           @arg @ref FL_ADC_ACQ1
  *           @arg @ref FL_ADC_ACQ2
  *           @arg @ref FL_ADC_ACQ3
  *           @arg @ref FL_ADC_ACQ4
  *           @arg @ref FL_ADC_ACQ5
  *           @arg @ref FL_ADC_ACQ6
  *           @arg @ref FL_ADC_ACQ7
  *           @arg @ref FL_ADC_ACQ8
  *           @arg @ref FL_ADC_ACQ9
  *           @arg @ref FL_ADC_ACQ10
  *           @arg @ref FL_ADC_ACQ11
  *           @arg @ref FL_ADC_ACQ12
  *           @arg @ref FL_ADC_ACQ13
  *           @arg @ref FL_ADC_ACQ14
  *           @arg @ref FL_ADC_ACQ15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabledACQ_DMACombination(ADC_Type *ADCx, uint32_t acqx_comb)
{
    return (uint32_t)(READ_BIT(ADCx->DMACOMB_CR, ((acqx_comb & 0xffff) << 0x0U)) == ((acqx_comb & 0xffff) << 0x0U));
}

/**
  * @brief    Get DMA MODE ADCID
  * @rmtoll   DMACOMB_DR    ACQ_ID    FL_ADC_ReadDMA_ACQID
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadDMA_ACQID(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DMACOMB_DR, (0xfU << 16U)) >> 16U);
}

/**
  * @brief    Get DMA ACQ DATA
  * @rmtoll   DMACOMB_DR    COMB_DR    FL_ADC_ReadDMA_ACQData
  * @param    ADCx ADC instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_ADC_ReadDMA_ACQData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DMACOMB_DR, (0xfffU << 0U)) >> 0U);
}

/**
  * @}
  */

/** @defgroup ADC_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_ADC_CommonDeInit(void);
FL_ErrorStatus FL_ADC_CommonInit(FL_ADC_CommonInitTypeDef *ADC_CommonInitStruct);
FL_ErrorStatus  FL_ADC_DeInit(ADC_Type *ADCx);
FL_ErrorStatus FL_ADC_Init(ADC_Type *ADCx, FL_ADC_InitTypeDef  *ADC_InitStruct, uint32_t ACQx);

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FK5XX_FL_ADC_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-05-09*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
